{
    "intents": [
        {
            "tag": "greeting",
            "patterns": ["Hi there", "How are you", "Is anyone there?", "Hey", "Hola", "Hello", "Good day"],
            "responses": ["Hello Traveller!! I am your Virtual Assistant ", "Good to see you again", "Hi there, how can I help?"],
            "context": [""]
        },
        {
            "tag": "goodbye",
            "patterns": ["Bye", "See you later", "Goodbye", "Nice chatting to you, bye", "Till next time"],
            "responses": ["See you!", "Have a nice day", "Bye! Come back again soon."],
            "context": [""]
        },
        {
            "tag": "thanks",
            "patterns": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for helping me"],
            "responses": ["Happy to help!", "Any time!", "My pleasure"],
            "context": [""]
        },
        {
            "tag": "noanswer",
            "patterns": [],
            "responses": ["Sorry, can't understand you", "Please give me more info", "Not sure I understand"],
            "context": [""]
        },
        {
            "tag": "states",
            "patterns": [
                "I want to explore India, where should I go?",
                "Can you suggest some places to visit in India?",
                "Which states in India are worth traveling to?",
                "Tell me about tourism destinations in India.",
                "I'm planning a trip to India, where do you recommend I visit?"
            ],
            "responses": ["Where you want to travel in India???? 1. Andhra Pradesh 2. Arunachal Pradesh 3. Assam 4. Bihar 5. Chhattisgarh  5. Goa  6. Gujarat 7. Haryana 8. Himachal Pradesh 9. Jharkhand 10. Karnataka 11. Kerala 12. Madhya Pradesh 13. Maharashtra 14. Manipur 15. Meghalaya 16. Mizoram 17. Nagaland 18. Odisha 19. Punjab 20. Rajasthan 21. Sikkim 22. Tamil Nadu 23.Telangana 24. Tripura 25. Uttar Pradesh 26. Uttarakhand 27. West Bengal 28.Andaman and Nicobar Islands 29.Chandigarh 30.Dadra and Nagar Haveli and Daman and Diu 31. Lakshadweep 32. Delhi 33.Puducherry"],
            "context": [""]
        },
        
        {
            "tag": "Andhra Pradesh",
            "patterns": ["Tell me about Andhra Pradesh"],
            "responses": ["Andhra Pradesh, located in southern India, is known for its rich cultural heritage, historical sites, and scenic landscapes. Key attractions include the ancient temple of Tirupati, the hill station of Araku Valley, and the coastal city of Visakhapatnam."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Andhra_Pradesh",
            "patterns": [
                "Tell me about famous hotels in Andhra Pradesh",
                "Which are the best hotels in Andhra Pradesh?",
                "Can you recommend some popular hotels in Andhra Pradesh?"
            ],
            "responses": [
                "Here are some famous hotels in Andhra Pradesh: Novotel Visakhapatnam Varun Beach - Located by the beach, this hotel offers stunning views and top-notch services.ITC Kakatiya, Hyderabad - Combines traditional architecture with modern comforts, providing a unique stay experience."
            ],
            "context": [""]
        },{
            "tag": "Famous_Food_Andhra_Pradesh",
            "patterns": [
                "What are some famous dishes from Andhra Pradesh?",
                "Tell me about the popular food in Andhra Pradesh.",
                "Can you recommend some traditional Andhra Pradesh cuisine?"
            ],
            "responses": [
                "Certainly! Andhra Pradesh boasts a rich culinary heritage. Some iconic dishes include Gongura Pachadi, Pesarattu, Ariselu, Pulihora, and Gutti Vankaya. These are just a few examples of the delicious and diverse cuisine you can find in Andhra Pradesh."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Andhra_Pradesh",
            "patterns": [
                "Can you tell me about rooms to stay and their prices?",
                "What are the accommodation options and prices?",
                "I'm looking for rooms to stay. What are the rates?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices: Budget Room: Starting from ₹2000 per night, Standard Room: Starting from ₹4000 per night, Deluxe Room: Starting from ₹7000 per night, Suite: Starting from ₹14000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Andhra_Pradesh",
            "patterns": [
                "What are the transportation options available?",
                "How can I travel around Andhra Pradesh?",
                "Can you tell me about different modes of transportation?"
            ],
            "responses": [
                "You can explore Andhra Pradesh using various transportation options:\n\nPrivate Taxis: Convenient for city travel and short distances. Price range: ₹800 - ₹1500 per day.\nState Buses: Economical option for inter-city travel with extensive routes. Price range: ₹200 - ₹600 per ticket.\nTrains: Indian Railways connects major cities and towns within the state. Price range: ₹100 - ₹2000 per ticket.\nAuto-rickshaws: Ideal for short trips within cities, but fares may vary."
            ],
            "context": [""]
        },
        {
            "tag": "Arunachal Pradesh",
            "patterns": ["Tell me about Arunachal Pradesh"],
            "responses": ["Arunachal Pradesh, located in the northeastern part of India, is known for its pristine natural beauty, rich biodiversity, and diverse indigenous cultures. The state is home to breathtaking landscapes, including lush green valleys, snow-capped mountains, and gushing rivers. Key attractions include Tawang Monastery, Sela Pass, Namdapha National Park, and Ziro Valley. Arunachal Pradesh offers ample opportunities for trekking, wildlife viewing, and exploring tribal traditions."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Arunachal_Pradesh",
            "patterns": [
                "Tell me about famous hotels in Arunachal Pradesh",
                "Which are the best hotels in Arunachal Pradesh?",
                "Can you recommend some popular hotels in Arunachal Pradesh?"
            ],
            "responses": [
                "Here are some famous hotels in Arunachal Pradesh: Donyi Polo Ashok, Itanagar - A government-owned hotel offering comfortable accommodations and essential amenities. Hotel Pybss, Itanagar - Known for its hospitality and convenient location in the city center. Namsai Resort, Namsai - A serene resort providing a peaceful stay amidst nature."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Arunachal_Pradesh",
            "patterns": [
                "What are some famous dishes from Arunachal Pradesh?",
                "Tell me about the popular food in Arunachal Pradesh.",
                "Can you recommend some traditional Arunachal Pradesh cuisine?"
            ],
            "responses": [
                "Certainly! Arunachal Pradesh offers a diverse range of delicious dishes reflecting its rich cultural heritage. Some iconic dishes include Apong (rice beer), Momos, Thukpa, Bamboo Shoot Fry, and Pika Pila. These are just a few examples of the mouthwatering cuisine you can explore in Arunachal Pradesh."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Arunachal_Pradesh",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Arunachal Pradesh?",
                "What are the accommodation options and prices in Arunachal Pradesh?",
                "I'm looking for rooms to stay in Arunachal Pradesh. What are the rates?",
                "What are the prices of rooms available in Arunachal Pradesh?",
                "How much do rooms cost per night in Arunachal Pradesh?",
                "What are the rates for different types of rooms in Arunachal Pradesh?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Arunachal Pradesh: Budget Room: Starting from ₹1500 per night, Standard Room: Starting from ₹3000 per night, Deluxe Room: Starting from ₹5000 per night, Suite: Starting from ₹10000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Arunachal_Pradesh",
            "patterns": [
                "What are the transportation options available in Arunachal Pradesh?",
                "How can I travel around Arunachal Pradesh?",
                "Can you tell me about different modes of transportation in Arunachal Pradesh?"
            ],
            "responses": [
                "You can explore Arunachal Pradesh using various transportation options:\n\nPrivate Taxis: Convenient for city travel and short distances. Price range: ₹1000 - ₹2000 per day.\nState Buses: Economical option for inter-city travel with extensive routes. Price range: ₹150 - ₹500 per ticket.\nTrains: Limited railway connectivity, mainly available up to Naharlagun. Price range: ₹200 - ₹1500 per ticket.\nAuto-rickshaws: Available in some towns for short trips, but fares may vary.\nHelicopter Services: Available for travel to remote areas. Price range: ₹3000 - ₹5000 per ticket."
            ],
            "context": [""]
        },
        

        {
            "tag": "Assam",
            "patterns": ["Tell me about Assam"],
            "responses": ["Assam, located in northeastern India, is renowned for its tea gardens, lush green landscapes, and rich cultural heritage. The state is home to the mighty Brahmaputra River, Kaziranga National Park (famous for one-horned rhinoceros), and historic sites like Kamakhya Temple and Sivasagar. Assam is also known for its traditional festivals, such as Bihu, and delicious cuisine."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Assam",
            "patterns": [
                "Tell me about famous hotels in Assam",
                "Which are the best hotels in Assam?",
                "Can you recommend some popular hotels in Assam?"
            ],
            "responses": [
                "Here are some famous hotels in Assam: Radisson Blu Hotel, Guwahati - A luxury hotel offering world-class amenities and exquisite dining options. Vivanta Guwahati - Known for its elegant design and excellent services. Hotel Dynasty, Guwahati - A centrally located hotel offering comfortable accommodations and great hospitality."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Assam",
            "patterns": [
                "What are some famous dishes from Assam?",
                "Tell me about the popular food in Assam.",
                "Can you recommend some traditional Assamese cuisine?"
            ],
            "responses": [
                "Absolutely! Assam is known for its flavorful and aromatic cuisine. Some iconic dishes include Assamese Thali (a platter of various dishes), Masor Tenga (sour fish curry), Aloo Pitika (mashed potatoes with mustard oil and spices), Pitha (rice cakes), and Khar (a unique alkaline preparation). These are just a few examples of the delightful cuisine you can savor in Assam."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Assam",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Assam?",
                "What are the accommodation options and prices in Assam?",
                "I'm looking for rooms to stay in Assam. What are the rates?",
                "What are the prices of rooms available in Assam?",
                "How much do rooms cost per night in Assam?",
                "What are the rates for different types of rooms in Assam?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Assam: Budget Room: Starting from ₹1000 per night, Standard Room: Starting from ₹2500 per night, Deluxe Room: Starting from ₹4500 per night, Suite: Starting from ₹9000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Assam",
            "patterns": [
                "What are the transportation options available in Assam?",
                "How can I travel around Assam?",
                "Can you tell me about different modes of transportation in Assam?"
            ],
            "responses": [
                "You can explore Assam using various transportation options:\n\nPrivate Taxis: Convenient for city travel and short distances. Price range: ₹800 - ₹1500 per day.\nState Buses: Economical option for inter-city travel with extensive routes. Price range: ₹100 - ₹400 per ticket.\nTrains: Indian Railways connects major cities and towns within the state. Price range: ₹100 - ₹1500 per ticket.\nAuto-rickshaws: Ideal for short trips within cities, but fares may vary.\nFerries: Available for travel to riverine areas like Majuli. Price range: ₹20 - ₹150 per ticket."
            ],
            "context": [""]
        },
        
        {
            "tag": "Bihar",
            "patterns": ["Tell me about Bihar"],
            "responses": ["Bihar, located in eastern India, is steeped in history and spirituality. The state is known for its ancient sites like Bodh Gaya (where Buddha attained enlightenment), Nalanda University (a renowned ancient learning center), and Mahabodhi Temple. Bihar also boasts vibrant festivals, including Chhath Puja, and mouthwatering delicacies like litti chokha."],
            "context": [""]
        },

        {
            "tag": "Famous_Hotels_Bihar",
            "patterns": [
                "Tell me about famous hotels in Bihar",
                "Which are the best hotels in Bihar?",
                "Can you recommend some popular hotels in Bihar?"
            ],
            "responses": [
                "Here are some famous hotels in Bihar: Hotel Maurya, Patna - A luxury hotel offering world-class amenities and fine dining options. The Panache, Patna - Known for its modern design and excellent services. Hotel Chanakya, Patna - A centrally located hotel offering comfortable accommodations and great hospitality."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Bihar",
            "patterns": [
                "What are some famous dishes from Bihar?",
                "Tell me about the popular food in Bihar.",
                "Can you recommend some traditional Bihari cuisine?"
            ],
            "responses": [
                "Certainly! Bihar offers a rich variety of traditional dishes. Some iconic ones include Litti Chokha (roasted wheat balls with mashed potatoes and brinjal), Sattu Paratha (stuffed flatbread with roasted gram flour), Chana Ghugni (spicy chickpea curry), Thekua (sweet snack made with wheat flour and jaggery), and Dal Puri (fried bread with lentil stuffing). These are just a few examples of the delicious cuisine you can explore in Bihar."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Bihar",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Bihar?",
                "What are the accommodation options and prices in Bihar?",
                "I'm looking for rooms to stay in Bihar. What are the rates?",
                "What are the prices of rooms available in Bihar?",
                "How much do rooms cost per night in Bihar?",
                "What are the rates for different types of rooms in Bihar?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Bihar: Budget Room: Starting from ₹800 per night, Standard Room: Starting from ₹2000 per night, Deluxe Room: Starting from ₹3500 per night, Suite: Starting from ₹7000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Bihar",
            "patterns": [
                "What are the transportation options available in Bihar?",
                "How can I travel around Bihar?",
                "Can you tell me about different modes of transportation in Bihar?"
            ],
            "responses": [
                "You can explore Bihar using various transportation options:\n\nPrivate Taxis: Convenient for city travel and short distances. Price range: ₹800 - ₹1500 per day.\nState Buses: Economical option for inter-city travel with extensive routes. Price range: ₹100 - ₹500 per ticket.\nTrains: Indian Railways connects major cities and towns within the state. Price range: ₹100 - ₹1500 per ticket.\nAuto-rickshaws: Ideal for short trips within cities, but fares may vary.\nCycle-rickshaws: Available for short distances, offering an economical option."
            ],
            "context": [""]
        },
        
        {
            "tag": "Chhattisgarh",
            "patterns": ["Tell me about Chhattisgarh"],
            "responses": ["Chhattisgarh, located in central India, is characterized by its lush forests, diverse tribal cultures, and ancient temples. The state is home to attractions such as Chitrakoot Falls (the Niagara Falls of India), Bastar Palace, and Jagdalpur. Chhattisgarh offers unique experiences like tribal village visits, wildlife safaris, and traditional handicraft shopping."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Chhattisgarh",
            "patterns": [
                "Tell me about famous hotels in Chhattisgarh",
                "Which are the best hotels in Chhattisgarh?",
                "Can you recommend some popular hotels in Chhattisgarh?"
            ],
            "responses": [
                "Here are some famous hotels in Chhattisgarh: Courtyard by Marriott, Raipur - A luxury hotel offering world-class amenities and fine dining options. Hyatt Raipur - Known for its modern design and excellent services. Hotel Babylon International, Raipur - A centrally located hotel offering comfortable accommodations and great hospitality."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Chhattisgarh",
            "patterns": [
                "What are some famous dishes from Chhattisgarh?",
                "Tell me about the popular food in Chhattisgarh.",
                "Can you recommend some traditional Chhattisgarhi cuisine?"
            ],
            "responses": [
                "Of course! Chhattisgarhi cuisine is known for its rich flavors and unique dishes. Some iconic ones include Farra (steamed rice flour dumplings), Chila (gram flour pancakes), Bara (a lentil-based snack), Bore Baasi (dried lentil dumplings), and Bhajia (fritters made with various vegetables). These are just a few examples of the delectable cuisine you can enjoy in Chhattisgarh."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Chhattisgarh",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Chhattisgarh?",
                "What are the accommodation options and prices in Chhattisgarh?",
                "I'm looking for rooms to stay in Chhattisgarh. What are the rates?",
                "What are the prices of rooms available in Chhattisgarh?",
                "How much do rooms cost per night in Chhattisgarh?",
                "What are the rates for different types of rooms in Chhattisgarh?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Chhattisgarh: Budget Room: Starting from ₹1000 per night, Standard Room: Starting from ₹2500 per night, Deluxe Room: Starting from ₹4500 per night, Suite: Starting from ₹9000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Chhattisgarh",
            "patterns": [
                "What are the transportation options available in Chhattisgarh?",
                "How can I travel around Chhattisgarh?",
                "Can you tell me about different modes of transportation in Chhattisgarh?"
            ],
            "responses": [
                "You can explore Chhattisgarh using various transportation options:\n\nPrivate Taxis: Convenient for city travel and short distances. Price range: ₹800 - ₹1500 per day.\nState Buses: Economical option for inter-city travel with extensive routes. Price range: ₹100 - ₹500 per ticket.\nTrains: Indian Railways connects major cities and towns within the state. Price range: ₹100 - ₹1500 per ticket.\nAuto-rickshaws: Ideal for short trips within cities, but fares may vary.\nCycle-rickshaws: Available for short distances, offering an economical option."
            ],
            "context": [""]
        },
        
        {
            "tag": "Goa",
            "patterns": ["Tell me about Goa"],
            "responses": ["Goa, located on the southwestern coast of India, is famous for its beautiful beaches, vibrant nightlife, and Portuguese heritage. The state offers a mix of relaxation and adventure with attractions like Calangute Beach, Dudhsagar Waterfalls, and Fort Aguada. Goa is also known for its seafood, water sports, and lively beach parties."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Goa",
            "patterns": [
                "Tell me about famous hotels in Goa",
                "Which are the best hotels in Goa?",
                "Can you recommend some popular hotels in Goa?"
            ],
            "responses": [
                "Here are some famous hotels in Goa: Taj Exotica, Benaulim - A luxury hotel offering world-class amenities and fine dining options. The Leela, Cavelossim - Known for its beautiful architecture and excellent services. Park Hyatt Goa Resort and Spa, Arossim - A beachfront hotel offering comfortable accommodations and great hospitality."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Goa",
            "patterns": [
                "What are some famous dishes from Goa?",
                "Tell me about the popular food in Goa.",
                "Can you recommend some traditional Goan cuisine?"
            ],
            "responses": [
                "Absolutely! Goa is renowned for its vibrant and flavorful cuisine. Some iconic dishes include Goan Fish Curry, Vindaloo, Xacuti, Bebinca (a traditional Goan dessert), and Feni (a local spirit). These are just a few examples of the mouthwatering dishes you can savor in Goa, reflecting its rich culinary heritage."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Goa",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Goa?",
                "What are the accommodation options and prices in Goa?",
                "I'm looking for rooms to stay in Goa. What are the rates?",
                "What are the prices of rooms available in Goa?",
                "How much do rooms cost per night in Goa?",
                "What are the rates for different types of rooms in Goa?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Goa: Budget Room: Starting from ₹1500 per night, Standard Room: Starting from ₹3500 per night, Deluxe Room: Starting from ₹6000 per night, Suite: Starting from ₹12000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Goa",
            "patterns": [
                "What are the transportation options available in Goa?",
                "How can I travel around Goa?",
                "Can you tell me about different modes of transportation in Goa?"
            ],
            "responses": [
                "You can explore Goa using various transportation options:\n\nPrivate Taxis: Convenient for city travel and short distances. Price range: ₹1000 - ₹2500 per day.\nState Buses: Economical option for inter-city travel with extensive routes. Price range: ₹20 - ₹150 per ticket.\nTrains: Indian Railways connects major cities and towns within the state. Price range: ₹100 - ₹2000 per ticket.\nAuto-rickshaws: Ideal for short trips within cities, but fares may vary.\nRental Scooters/Bikes: Popular among tourists for exploring the area. Price range: ₹300 - ₹800 per day."
            ],
            "context": [""]
        },
        
        {
            "tag": "Gujarat",
            "patterns": ["Tell me about Gujarat"],
            "responses": ["Gujarat, located in western India, is known for its rich history, vibrant culture, and architectural marvels. The state is home to iconic attractions such as the Rann of Kutch, Gir National Park (home to Asiatic lions), and the ancient city of Dwarka. Gujarat is also famous for its festivals like Navratri and its mouthwatering cuisine."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Gujarat",
            "patterns": [
                "Tell me about famous hotels in Gujarat",
                "Which are the best hotels in Gujarat?",
                "Can you recommend some popular hotels in Gujarat?"
            ],
            "responses": [
                "Here are some famous hotels in Gujarat: The Ummed, Ahmedabad - A luxury hotel offering world-class amenities and fine dining options. Taj Skyline, Ahmedabad - Known for its elegant design and excellent services. The Fern, Gir Forest Resort - A unique resort offering comfortable accommodations and great hospitality near the famous Gir National Park."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Gujarat",
            "patterns": [
                "What are some famous dishes from Gujarat?",
                "Tell me about the popular food in Gujarat.",
                "Can you recommend some traditional Gujarati cuisine?"
            ],
            "responses": [
                "Certainly! Gujarat is known for its diverse and delicious cuisine. Some iconic dishes include Dhokla, Thepla, Khandvi, Undhiyu, and Gujarati Kadhi. These are just a few examples of the flavorful and wholesome dishes you can enjoy in Gujarat, reflecting its rich culinary traditions."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Gujarat",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Gujarat?",
                "What are the accommodation options and prices in Gujarat?",
                "I'm looking for rooms to stay in Gujarat. What are the rates?",
                "What are the prices of rooms available in Gujarat?",
                "How much do rooms cost per night in Gujarat?",
                "What are the rates for different types of rooms in Gujarat?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Gujarat: Budget Room: Starting from ₹1000 per night, Standard Room: Starting from ₹2500 per night, Deluxe Room: Starting from ₹4500 per night, Suite: Starting from ₹9000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Gujarat",
            "patterns": [
                "What are the transportation options available in Gujarat?",
                "How can I travel around Gujarat?",
                "Can you tell me about different modes of transportation in Gujarat?"
            ],
            "responses": [
                "You can explore Gujarat using various transportation options:\n\nPrivate Taxis: Convenient for city travel and short distances. Price range: ₹800 - ₹1500 per day.\nState Buses: Economical option for inter-city travel with extensive routes. Price range: ₹100 - ₹500 per ticket.\nTrains: Indian Railways connects major cities and towns within the state. Price range: ₹100 - ₹1500 per ticket.\nAuto-rickshaws: Ideal for short trips within cities, but fares may vary.\nRental Cars: Available for self-driving, offering flexibility. Price range: ₹1500 - ₹3000 per day."
            ],
            "context": [""]
        },
        
        {
            "tag": "Haryana",
            "patterns": ["Tell me about Haryana"],
            "responses": ["Haryana, located in northern India, is known for its agricultural prosperity, historic sites, and vibrant culture. The state boasts attractions like Sultanpur National Park, Surajkund Mela, and the historic city of Kurukshetra. Haryana is also renowned for its traditional folk dances, such as Ghoomar and Giddha."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Haryana",
            "patterns": [
                "Tell me about famous hotels in Haryana",
                "Which are the best hotels in Haryana?",
                "Can you recommend some popular hotels in Haryana?"
            ],
            "responses": [
                "Here are some famous hotels in Haryana: The Oberoi, Gurgaon - A luxury hotel offering world-class amenities and fine dining options. The Westin, Gurgaon - Known for its modern design and excellent services. Vivanta by Taj, Surajkund - A luxurious resort offering comfortable accommodations and great hospitality."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Haryana",
            "patterns": [
                "What are some famous dishes from Haryana?",
                "Tell me about the popular food in Haryana.",
                "Can you recommend some traditional Haryanvi cuisine?"
            ],
            "responses": [
                "Absolutely! Haryana boasts a rich culinary heritage with flavorful dishes. Some iconic ones include Dal Makhani, Kadhi Pakora, Bajra Roti, Kachri ki Sabzi, and Hara Dhania Cholia. These are just a few examples of the hearty and delicious cuisine you can savor in Haryana, reflecting its agricultural roots and cultural diversity."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Haryana",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Haryana?",
                "What are the accommodation options and prices in Haryana?",
                "I'm looking for rooms to stay in Haryana. What are the rates?",
                "What are the prices of rooms available in Haryana?",
                "How much do rooms cost per night in Haryana?",
                "What are the rates for different types of rooms in Haryana?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Haryana: Budget Room: Starting from ₹1500 per night, Standard Room: Starting from ₹3500 per night, Deluxe Room: Starting from ₹6000 per night, Suite: Starting from ₹12000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Haryana",
            "patterns": [
                "What are the transportation options available in Haryana?",
                "How can I travel around Haryana?",
                "Can you tell me about different modes of transportation in Haryana?"
            ],
            "responses": [
                "You can explore Haryana using various transportation options:\n\nPrivate Taxis: Convenient for city travel and short distances. Price range: ₹1000 - ₹2500 per day.\nState Buses: Economical option for inter-city travel with extensive routes. Price range: ₹50 - ₹300 per ticket.\nTrains: Indian Railways connects major cities and towns within the state. Price range: ₹100 - ₹2000 per ticket.\nAuto-rickshaws: Ideal for short trips within cities, but fares may vary.\nRental Cars: Available for self-driving, offering flexibility. Price range: ₹1500 - ₹3000 per day."
            ],
            "context": [""]
        },
        
        {
            "tag": "Himachal Pradesh",
            "patterns": ["Tell me about Himachal Pradesh"],
            "responses": ["Himachal Pradesh, nestled in the Himalayas, is famous for its scenic beauty, adventure sports, and spiritual sites. The state is home to attractions like Shimla (the queen of hill stations), Manali, Dharamshala (the residence of the Dalai Lama), and Rohtang Pass. Himachal Pradesh offers activities like trekking, skiing, and paragliding."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Himachal_Pradesh",
            "patterns": [
                "Tell me about famous hotels in Himachal Pradesh",
                "Which are the best hotels in Himachal Pradesh?",
                "Can you recommend some popular hotels in Himachal Pradesh?"
            ],
            "responses": [
                "Here are some famous hotels in Himachal Pradesh: Wildflower Hall, Shimla - A luxury hotel offering world-class amenities and breathtaking views of the Himalayas. The Oberoi Cecil, Shimla - Known for its colonial charm and impeccable service. The Himalayan, Manali - A serene resort nestled in the Himalayas offering luxurious accommodations and tranquil surroundings."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Himachal_Pradesh",
            "patterns": [
                "What are some famous dishes from Himachal Pradesh?",
                "Tell me about the popular food in Himachal Pradesh.",
                "Can you recommend some traditional Himachali cuisine?"
            ],
            "responses": [
                "Certainly! Himachal Pradesh offers a delightful array of traditional dishes. Some iconic ones include Dham (a traditional feast served during festivals), Siddu (steamed bread made with wheat flour and filled with stuffing), Chana Madra (chickpea curry in yogurt gravy), Babru (deep-fried stuffed bread), and Tudkiya Bhath (a rice dish cooked with lentils and spices). These are just a few examples of the delicious cuisine you can explore in Himachal Pradesh."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Himachal_Pradesh",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Himachal Pradesh?",
                "What are the accommodation options and prices in Himachal Pradesh?",
                "I'm looking for rooms to stay in Himachal Pradesh. What are the rates?",
                "What are the prices of rooms available in Himachal Pradesh?",
                "How much do rooms cost per night in Himachal Pradesh?",
                "What are the rates for different types of rooms in Himachal Pradesh?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Himachal Pradesh: Budget Room: Starting from ₹1500 per night, Standard Room: Starting from ₹3500 per night, Deluxe Room: Starting from ₹6000 per night, Suite: Starting from ₹12000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Himachal_Pradesh",
            "patterns": [
                "What are the transportation options available in Himachal Pradesh?",
                "How can I travel around Himachal Pradesh?",
                "Can you tell me about different modes of transportation in Himachal Pradesh?"
            ],
            "responses": [
                "You can explore Himachal Pradesh using various transportation options:\n\nPrivate Taxis: Convenient for city travel and short distances. Price range: ₹1000 - ₹3000 per day.\nState Buses: Economical option for inter-city travel with extensive routes. Price range: ₹100 - ₹1000 per ticket.\nTrains: Limited railway connectivity, mainly available up to Kalka for the famous toy train ride. Price range: ₹50 - ₹1000 per ticket.\nAuto-rickshaws: Available in some towns for short trips, but fares may vary.\nRental Cars: Available for self-driving, offering flexibility. Price range: ₹1500 - ₹4000 per day."
            ],
            "context": [""]
        },
        

        {
            "tag": "Jharkhand",
            "patterns": ["Tell me about Jharkhand"],
            "responses": ["Jharkhand, located in eastern India, is known for its rich mineral resources, tribal culture, and natural beauty. The state is home to attractions like Betla National Park, Tagore Hill, and Hazaribagh Wildlife Sanctuary. Jharkhand offers unique experiences like tribal village tours, rock climbing, and exploring ancient cave paintings."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Jharkhand",
            "patterns": [
                "Tell me about famous hotels in Jharkhand",
                "Which are the best hotels in Jharkhand?",
                "Can you recommend some popular hotels in Jharkhand?"
            ],
            "responses": [
                "Here are some famous hotels in Jharkhand: Radisson Blu, Ranchi - A luxury hotel offering world-class amenities and fine dining options. Le Lac Sarovar Portico, Ranchi - Known for its elegant design and excellent services. Capitol Hill, Ranchi - A centrally located hotel offering comfortable accommodations and great hospitality."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Jharkhand",
            "patterns": [
                "What are some famous dishes from Jharkhand?",
                "Tell me about the popular food in Jharkhand.",
                "Can you recommend some traditional Jharkhandi cuisine?"
            ],
            "responses": [
                "Of course! Jharkhand offers a diverse range of traditional dishes. Some iconic ones include Dhuska (deep-fried rice and lentil pancakes), Chilka Roti (sorghum flatbread), Pittha (steamed rice dumplings with lentil filling), Handia (rice beer), and Rugra (a type of mushroom curry). These are just a few examples of the delicious cuisine you can savor in Jharkhand."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Jharkhand",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Jharkhand?",
                "What are the accommodation options and prices in Jharkhand?",
                "I'm looking for rooms to stay in Jharkhand. What are the rates?",
                "What are the prices of rooms available in Jharkhand?",
                "How much do rooms cost per night in Jharkhand?",
                "What are the rates for different types of rooms in Jharkhand?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Jharkhand: Budget Room: Starting from ₹1000 per night, Standard Room: Starting from ₹2500 per night, Deluxe Room: Starting from ₹4500 per night, Suite: Starting from ₹9000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Jharkhand",
            "patterns": [
                "What are the transportation options available in Jharkhand?",
                "How can I travel around Jharkhand?",
                "Can you tell me about different modes of transportation in Jharkhand?"
            ],
            "responses": [
                "You can explore Jharkhand using various transportation options:\n\nPrivate Taxis: Convenient for city travel and short distances. Price range: ₹800 - ₹1500 per day.\nState Buses: Economical option for inter-city travel with extensive routes. Price range: ₹50 - ₹300 per ticket.\nTrains: Indian Railways connects major cities and towns within the state. Price range: ₹100 - ₹1500 per ticket.\nAuto-rickshaws: Ideal for short trips within cities, but fares may vary.\nCycle-rickshaws: Available for short distances, offering an economical option."
            ],
            "context": [""]
        },
        
        {
            "tag": "Karnataka",
            "patterns": ["Tell me about Karnataka"],
            "responses": ["Karnataka, located in southwestern India, is renowned for its rich heritage, vibrant culture, and diverse landscapes. The state is home to attractions like Hampi (a UNESCO World Heritage Site), Mysore Palace, Jog Falls, and the hill station of Coorg. Karnataka offers experiences like wildlife safaris, temple tours, and coffee plantation visits."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Karnataka",
            "patterns": [
                "Tell me about famous hotels in Karnataka",
                "Which are the best hotels in Karnataka?",
                "Can you recommend some popular hotels in Karnataka?"
            ],
            "responses": [
                "Here are some famous hotels in Karnataka: The Leela Palace, Bengaluru - A luxury hotel offering world-class amenities and fine dining options. Taj West End, Bengaluru - Known for its lush gardens and excellent services. The Lalit Ashok, Bengaluru - A centrally located hotel offering comfortable accommodations and great hospitality."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Karnataka",
            "patterns": [
                "What are some famous dishes from Karnataka?",
                "Tell me about the popular food in Karnataka.",
                "Can you recommend some traditional Karnataka cuisine?"
            ],
            "responses": [
                "Absolutely! Karnataka offers a rich variety of traditional dishes. Some iconic ones include Bisi Bele Bath (hot lentil rice), Mysore Masala Dosa, Ragi Mudde (finger millet balls), Neer Dosa (thin rice crepes), and Mysore Pak (sweet dessert). These are just a few examples of the delicious and diverse cuisine you can enjoy in Karnataka."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Karnataka",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Karnataka?",
                "What are the accommodation options and prices in Karnataka?",
                "I'm looking for rooms to stay in Karnataka. What are the rates?",
                "What are the prices of rooms available in Karnataka?",
                "How much do rooms cost per night in Karnataka?",
                "What are the rates for different types of rooms in Karnataka?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Karnataka: Budget Room: Starting from ₹1500 per night, Standard Room: Starting from ₹3500 per night, Deluxe Room: Starting from ₹6000 per night, Suite: Starting from ₹12000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Karnataka",
            "patterns": [
                "What are the transportation options available in Karnataka?",
                "How can I travel around Karnataka?",
                "Can you tell me about different modes of transportation in Karnataka?"
            ],
            "responses": [
                "You can explore Karnataka using various transportation options:\n\nPrivate Taxis: Convenient for city travel and short distances. Price range: ₹1000 - ₹3000 per day.\nState Buses: Economical option for inter-city travel with extensive routes. Price range: ₹50 - ₹1000 per ticket.\nTrains: Indian Railways connects major cities and towns within the state. Price range: ₹100 - ₹2000 per ticket.\nMetro: Available in Bengaluru for convenient city travel. Price range: ₹10 - ₹60 per trip.\nAuto-rickshaws: Ideal for short trips within cities, but fares may vary."
            ],
            "context": [""]
        },
        
        {
            "tag": "Kerala",
            "patterns": ["Tell me about Kerala"],
            "responses": ["Kerala, often referred to as 'God's Own Country', is known for its serene backwaters, palm-fringed beaches, and lush greenery. The state boasts attractions like Alleppey backwaters, Munnar tea gardens, Periyar Wildlife Sanctuary, and the scenic hill station of Wayanad. Kerala offers experiences like houseboat cruises, Ayurvedic treatments, and cultural performances."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Kerala",
            "patterns": [
                "Tell me about famous hotels in Kerala",
                "Which are the best hotels in Kerala?",
                "Can you recommend some popular hotels in Kerala?"
            ],
            "responses": [
                "Here are some famous hotels in Kerala: The Leela Kovalam, Kovalam - A luxury beachfront hotel offering world-class amenities and fine dining options. Taj Malabar Resort & Spa, Kochi - Known for its picturesque location and excellent services. Kumarakom Lake Resort, Kumarakom - A serene backwater resort offering luxurious accommodations and tranquil surroundings."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Kerala",
            "patterns": [
                "What are some famous dishes from Kerala?",
                "Tell me about popular food in Kerala.",
                "Can you recommend some traditional Kerala cuisine?"
            ],
            "responses": [
                "Certainly! Kerala is renowned for its flavorful and aromatic cuisine. Some iconic dishes include Appam with Stew, Puttu and Kadala Curry, Fish Moilee, Kerala Style Beef Fry, and Avial. These are just a few examples of the mouthwatering dishes you can savor in Kerala, reflecting its rich culinary heritage and diverse ingredients."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Kerala",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Kerala?",
                "What are the accommodation options and prices in Kerala?",
                "I'm looking for rooms to stay in Kerala. What are the rates?",
                "What are the prices of rooms available in Kerala?",
                "How much do rooms cost per night in Kerala?",
                "What are the rates for different types of rooms in Kerala?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Kerala: Budget Room: Starting from ₹1500 per night, Standard Room: Starting from ₹3500 per night, Deluxe Room: Starting from ₹6000 per night, Suite: Starting from ₹12000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Kerala",
            "patterns": [
                "What are the transportation options available in Kerala?",
                "How can I travel around Kerala?",
                "Can you tell me about different modes of transportation in Kerala?"
            ],
            "responses": [
                "You can explore Kerala using various transportation options:\n\nPrivate Taxis: Convenient for city travel and exploring tourist attractions. Price range: ₹1000 - ₹3000 per day.\nState Buses: Economical option for inter-city travel with extensive routes. Price range: ₹50 - ₹500 per ticket.\nTrains: Indian Railways connects major cities and towns within the state. Price range: ₹100 - ₹2000 per ticket.\nBoats: Ideal for exploring the backwaters and coastal areas. Price range: ₹200 - ₹2000 per trip.\nAuto-rickshaws: Available for short trips within cities, but fares may vary."
            ],
            "context": [""]
        },
        

        {
            "tag": "Madhya Pradesh",
            "patterns": ["Tell me about Madhya Pradesh"],
            "responses": ["Madhya Pradesh, located in central India, is known for its rich history, architectural wonders, and wildlife sanctuaries. The state is home to attractions like Khajuraho Temples, Sanchi Stupa, Bandhavgarh National Park, and Kanha Tiger Reserve. Madhya Pradesh offers experiences like heritage walks, wildlife safaris, and exploring ancient cave paintings."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Madhya_Pradesh",
            "patterns": [
                "Tell me about famous hotels in Madhya Pradesh",
                "Which are the best hotels in Madhya Pradesh?",
                "Can you recommend some popular hotels in Madhya Pradesh?"
            ],
            "responses": [
                "Here are some famous hotels in Madhya Pradesh: Jehan Numa Palace Hotel, Bhopal - A luxury heritage hotel offering world-class amenities and fine dining options. Noor-Us-Sabah Palace, Bhopal - Known for its royal ambiance and excellent services. Taj Usha Kiran Palace, Gwalior - A majestic palace hotel offering luxurious accommodations and rich heritage."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Madhya_Pradesh",
            "patterns": [
                "What are some famous dishes from Madhya Pradesh?",
                "Tell me about the popular food in Madhya Pradesh.",
                "Can you recommend some traditional Madhya Pradesh cuisine?"
            ],
            "responses": [
                "Of course! Madhya Pradesh offers a delightful array of traditional dishes. Some iconic ones include Poha, Bhutte Ka Kees (grated corn stir-fry), Dal Bafla (a variation of Dal Bati), Sabudana Khichdi, and Bhutte Ka Khees (grated corn cooked with milk and spices). These are just a few examples of the delicious cuisine you can explore in Madhya Pradesh."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Madhya_Pradesh",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Madhya Pradesh?",
                "What are the accommodation options and prices in Madhya Pradesh?",
                "I'm looking for rooms to stay in Madhya Pradesh. What are the rates?",
                "What are the prices of rooms available in Madhya Pradesh?",
                "How much do rooms cost per night in Madhya Pradesh?",
                "What are the rates for different types of rooms in Madhya Pradesh?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Madhya Pradesh: Budget Room: Starting from ₹1000 per night, Standard Room: Starting from ₹2500 per night, Deluxe Room: Starting from ₹4500 per night, Suite: Starting from ₹9000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Madhya_Pradesh",
            "patterns": [
                "What are the transportation options available in Madhya Pradesh?",
                "How can I travel around Madhya Pradesh?",
                "Can you tell me about different modes of transportation in Madhya Pradesh?"
            ],
            "responses": [
                "You can explore Madhya Pradesh using various transportation options:\n\nPrivate Taxis: Convenient for city travel and short distances. Price range: ₹800 - ₹2000 per day.\nState Buses: Economical option for inter-city travel with extensive routes. Price range: ₹50 - ₹500 per ticket.\nTrains: Indian Railways connects major cities and towns within the state. Price range: ₹100 - ₹2000 per ticket.\nAuto-rickshaws: Ideal for short trips within cities, but fares may vary.\nRental Cars: Available for self-driving, offering flexibility. Price range: ₹1500 - ₹3500 per day."
            ],
            "context": [""]
        },
        
        {
            "tag": "Maharashtra",
            "patterns": ["Tell me about Maharashtra"],
            "responses": ["Maharashtra, located in western India, is known for its bustling cities, historic landmarks, and scenic beauty. The state is home to attractions like Mumbai (the financial capital of India), Ajanta and Ellora Caves (UNESCO World Heritage Sites), Gateway of India, and the hill station of Lonavala. Maharashtra offers experiences like Bollywood tours, beach hopping, and exploring ancient caves."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Maharashtra",
            "patterns": [
                "Tell me about famous hotels in Maharashtra",
                "Which are the best hotels in Maharashtra?",
                "Can you recommend some popular hotels in Maharashtra?"
            ],
            "responses": [
                "Here are some famous hotels in Maharashtra: The Taj Mahal Palace, Mumbai - A luxury hotel offering world-class amenities and fine dining options. The Oberoi, Mumbai - Known for its elegant design and impeccable service. The Leela, Mumbai - A luxurious hotel offering stunning views of the Arabian Sea and top-notch hospitality."
            ],
            "context": [""]
        },{
            "tag": "Famous_Food_Maharashtra",
            "patterns": [
                "What are some famous dishes from Maharashtra?",
                "Tell me about the popular food in Maharashtra.",
                "Can you recommend some traditional Maharashtrian cuisine?"
            ],
            "responses": [
                "Absolutely! Maharashtra is known for its diverse and flavorful cuisine. Some iconic dishes include Vada Pav, Pav Bhaji, Misal Pav, Puran Poli (sweet flatbread), and Modak (sweet dumplings). These are just a few examples of the mouthwatering dishes you can savor in Maharashtra, reflecting its rich culinary heritage and cultural diversity."
            ],
            "context": [""]
        },
        

        {
            "tag": "Rooms_To_Stay_With_Prices_Maharashtra",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Maharashtra?",
                "What are the accommodation options and prices in Maharashtra?",
                "I'm looking for rooms to stay in Maharashtra. What are the rates?",
                "What are the prices of rooms available in Maharashtra?",
                "How much do rooms cost per night in Maharashtra?",
                "What are the rates for different types of rooms in Maharashtra?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Maharashtra: Budget Room: Starting from ₹1500 per night, Standard Room: Starting from ₹3500 per night, Deluxe Room: Starting from ₹6000 per night, Suite: Starting from ₹12000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Maharashtra",
            "patterns": [
                "What are the transportation options available in Maharashtra?",
                "How can I travel around Maharashtra?",
                "Can you tell me about different modes of transportation in Maharashtra?"
            ],
            "responses": [
                "You can explore Maharashtra using various transportation options:\n\nLocal Trains: Suburban trains are the lifeline of Mumbai, connecting the city and its suburbs. Price range: ₹5 - ₹100 per ticket.\nMetro: Available in Mumbai and Pune for convenient city travel. Price range: ₹10 - ₹100 per trip.\nState Buses: Maharashtra State Road Transport Corporation (MSRTC) operates buses across the state. Price range: ₹20 - ₹1000 per ticket.\nPrivate Taxis: Convenient for city travel and exploring tourist attractions. Price range: ₹1000 - ₹3000 per day.\nAuto-rickshaws: Ideal for short trips within cities, but fares may vary."
            ],
            "context": [""]
        },
        
        {
            "tag": "Manipur",
            "patterns": ["Tell me about Manipur"],
            "responses": ["Manipur, located in northeastern India, is known for its natural beauty, rich culture, and martial arts. The state is home to attractions like Loktak Lake (the largest freshwater lake in Northeast India), Kangla Fort, and Keibul Lamjao National Park (home to the endangered Sangai deer). Manipur offers experiences like trekking, boating, and exploring ancient temples."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Manipur",
            "patterns": [
                "Tell me about famous hotels in Manipur",
                "Which are the best hotels in Manipur?",
                "Can you recommend some popular hotels in Manipur?"
            ],
            "responses": [
                "Here are some famous hotels in Manipur: Classic Grande, Imphal - A luxury hotel offering world-class amenities and fine dining options. Hotel Imphal, Imphal - Known for its comfortable accommodations and excellent services. The Classic Hotel, Imphal - A centrally located hotel offering convenience and warm hospitality."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Manipur",
            "patterns": [
                "What are some famous dishes from Manipur?",
                "Tell me about the popular food in Manipur.",
                "Can you recommend some traditional Manipuri cuisine?"
            ],
            "responses": [
                "Certainly! Manipuri cuisine is known for its unique flavors and ingredients. Some iconic dishes include Eromba (a spicy stew with vegetables and fish), Chamthong (a mixed vegetable stew), Kangsoi (a clear soup with seasonal vegetables), Ngari (fermented fish), and Chak-hao Kheer (black rice pudding). These are just a few examples of the delicious cuisine you can explore in Manipur, reflecting its rich cultural heritage and diverse culinary traditions."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Manipur",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Manipur?",
                "What are the accommodation options and prices in Manipur?",
                "I'm looking for rooms to stay in Manipur. What are the rates?",
                "What are the prices of rooms available in Manipur?",
                "How much do rooms cost per night in Manipur?",
                "What are the rates for different types of rooms in Manipur?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Manipur: Budget Room: Starting from ₹1000 per night, Standard Room: Starting from ₹2500 per night, Deluxe Room: Starting from ₹4500 per night, Suite: Starting from ₹9000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Manipur",
            "patterns": [
                "What are the transportation options available in Manipur?",
                "How can I travel around Manipur?",
                "Can you tell me about different modes of transportation in Manipur?"
            ],
            "responses": [
                "You can explore Manipur using various transportation options:\n\nTaxis: Available for city travel and exploring tourist attractions. Price range: ₹500 - ₹2000 per day.\nState Buses: Economical option for inter-city travel with extensive routes. Price range: ₹50 - ₹500 per ticket.\nAuto-rickshaws: Ideal for short trips within cities, but fares may vary.\nShared Sumos: Common mode of transport for traveling between towns and neighboring states. Price range: ₹50 - ₹500 per trip."
            ],
            "context": [""]
        },
        
        {
            "tag": "Meghalaya",
            "patterns": ["Tell me about Meghalaya"],
            "responses": ["Meghalaya, known as the 'Abode of Clouds', is famous for its breathtaking landscapes, cascading waterfalls, and living root bridges. The state is home to attractions like Cherrapunji (one of the wettest places on earth), Dawki River, and Mawlynnong (Asia's cleanest village). Meghalaya offers experiences like trekking through lush green forests, caving, and exploring indigenous Khasi culture."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Meghalaya",
            "patterns": [
                "Tell me about famous hotels in Meghalaya",
                "Which are the best hotels in Meghalaya?",
                "Can you recommend some popular hotels in Meghalaya?"
            ],
            "responses": [
                "Here are some famous hotels in Meghalaya: Ri Kynjai - Serenity by the Lake, Shillong - A luxury resort offering tranquil surroundings and traditional Khasi hospitality. Polo Orchid Resort, Cherrapunji - Known for its picturesque location and comfortable accommodations. The Eee Cee Hotel, Shillong - A centrally located hotel offering convenience and warm hospitality."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Meghalaya",
            "patterns": [
                "What are some famous dishes from Meghalaya?",
                "Tell me about the popular food in Meghalaya.",
                "Can you recommend some traditional Meghalayan cuisine?"
            ],
            "responses": [
                "Absolutely! Meghalaya offers a delightful array of traditional dishes. Some iconic ones include Jadoh (rice dish with meat), Doh Khlieh (pork salad), Jhur Seng (fermented soybean paste), Nakham Bitchi (fermented fish chutney), and Pukhlein (sweet rice cake). These are just a few examples of the delicious cuisine you can savor in Meghalaya, reflecting its rich cultural heritage and diverse culinary traditions."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Meghalaya",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Meghalaya?",
                "What are the accommodation options and prices in Meghalaya?",
                "I'm looking for rooms to stay in Meghalaya. What are the rates?",
                "What are the prices of rooms available in Meghalaya?",
                "How much do rooms cost per night in Meghalaya?",
                "What are the rates for different types of rooms in Meghalaya?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Meghalaya: Budget Room: Starting from ₹1000 per night, Standard Room: Starting from ₹2500 per night, Deluxe Room: Starting from ₹4500 per night, Suite: Starting from ₹9000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Meghalaya",
            "patterns": [
                "What are the transportation options available in Meghalaya?",
                "How can I travel around Meghalaya?",
                "Can you tell me about different modes of transportation in Meghalaya?"
            ],
            "responses": [
                "You can explore Meghalaya using various transportation options:\n\nTaxis: Available for city travel and exploring tourist attractions. Price range: ₹500 - ₹2000 per day.\nState Buses: Limited but available for inter-city travel. Price range: ₹50 - ₹500 per ticket.\nShared Taxis: Common mode of transport for traveling between towns and neighboring states. Price range: ₹50 - ₹500 per trip."
            ],
            "context": [""]
        },
        
        {
            "tag": "Mizoram",
            "patterns": ["Tell me about Mizoram"],
            "responses": ["Mizoram, located in northeastern India, is known for its scenic beauty, vibrant festivals, and rich cultural heritage. The state is home to attractions like Durtlang Hills, Tamdil Lake, and Reiek Tlang (Reiek Peak). Mizoram offers experiences like exploring traditional Mizo villages, trekking through pristine forests, and participating in colorful festivals."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Mizoram",
            "patterns": [
                "Tell me about famous hotels in Mizoram",
                "Which are the best hotels in Mizoram?",
                "Can you recommend some popular hotels in Mizoram?"
            ],
            "responses": [
                "Here are some famous hotels in Mizoram: The Aizawl City Hotel, Aizawl - A centrally located hotel offering convenience and warm hospitality. Hotel Regency, Aizawl - Known for its comfortable accommodations and excellent services. The Grand Hotel, Aizawl - A budget-friendly hotel offering basic amenities and a convenient location."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Mizoram",
            "patterns": [
                "What are some famous dishes from Mizoram?",
                "Tell me about the popular food in Mizoram.",
                "Can you recommend some traditional Mizo cuisine?"
            ],
            "responses": [
                "Certainly! Mizoram is known for its unique and flavorful cuisine. Some iconic dishes include Bai (a traditional Mizo stew), Vawksa Rep (smoked pork), Misa Mach Poora (fried fish), Sawhchiar (a mixed vegetable dish), and Koat Pitha (rice flour pancake). These are just a few examples of the delicious cuisine you can explore in Mizoram, reflecting its rich cultural heritage and culinary traditions."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Mizoram",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Mizoram?",
                "What are the accommodation options and prices in Mizoram?",
                "I'm looking for rooms to stay in Mizoram. What are the rates?",
                "What are the prices of rooms available in Mizoram?",
                "How much do rooms cost per night in Mizoram?",
                "What are the rates for different types of rooms in Mizoram?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Mizoram: Budget Room: Starting from ₹1000 per night, Standard Room: Starting from ₹2000 per night, Deluxe Room: Starting from ₹4000 per night, Suite: Starting from ₹8000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Mizoram",
            "patterns": [
                "What are the transportation options available in Mizoram?",
                "How can I travel around Mizoram?",
                "Can you tell me about different modes of transportation in Mizoram?"
            ],
            "responses": [
                "You can explore Mizoram using various transportation options:\n\nTaxis: Available for city travel and exploring tourist attractions. Price range: ₹500 - ₹1500 per day.\nState Buses: Limited but available for inter-city travel. Price range: ₹50 - ₹300 per ticket.\nShared Taxis: Common mode of transport for traveling between towns and neighboring states. Price range: ₹50 - ₹500 per trip."
            ],
            "context": [""]
        },
        
        {
            "tag": "Nagaland",
            "patterns": ["Tell me about Nagaland"],
            "responses": ["Nagaland, located in northeastern India, is known for its rich tribal heritage, scenic landscapes, and unique festivals. The state is home to attractions like Dzukou Valley, Kohima War Cemetery, and the Hornbill Festival (celebrating Nagaland's culture and traditions). Nagaland offers experiences like trekking in lush green hills, exploring ancient tribal villages, and enjoying traditional Naga cuisine."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Nagaland",
            "patterns": [
                "Tell me about famous hotels in Nagaland",
                "Which are the best hotels in Nagaland?",
                "Can you recommend some popular hotels in Nagaland?"
            ],
            "responses": [
                "Here are some famous hotels in Nagaland: Hotel Japfü, Kohima - A centrally located hotel offering convenience and warm hospitality. Hotel Vivor, Kohima - Known for its comfortable accommodations and excellent services. The Heritage, Dimapur - A budget-friendly hotel offering basic amenities and a convenient location."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Nagaland",
            "patterns": [
                "What are some famous dishes from Nagaland?",
                "Tell me about the popular food in Nagaland.",
                "Can you recommend some traditional Naga cuisine?"
            ],
            "responses": [
                "Absolutely! Nagaland is known for its unique and flavorful cuisine. Some iconic dishes include Smoked Pork with Akhuni (fermented soybean), Bamboo Shoot Curry, Axone (fermented soybean dish), Naga Style Chicken Curry, and Galho (rice cooked with mixed vegetables). These are just a few examples of the delicious cuisine you can savor in Nagaland, reflecting its rich cultural heritage and culinary traditions."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Nagaland",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Nagaland?",
                "What are the accommodation options and prices in Nagaland?",
                "I'm looking for rooms to stay in Nagaland. What are the rates?",
                "What are the prices of rooms available in Nagaland?",
                "How much do rooms cost per night in Nagaland?",
                "What are the rates for different types of rooms in Nagaland?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Nagaland: Budget Room: Starting from ₹1000 per night, Standard Room: Starting from ₹2000 per night, Deluxe Room: Starting from ₹4000 per night, Suite: Starting from ₹8000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Nagaland",
            "patterns": [
                "What are the transportation options available in Nagaland?",
                "How can I travel around Nagaland?",
                "Can you tell me about different modes of transportation in Nagaland?"
            ],
            "responses": [
                "You can explore Nagaland using various transportation options:\n\nTaxis: Available for city travel and exploring tourist attractions. Price range: ₹500 - ₹1500 per day.\nState Buses: Limited but available for inter-city travel. Price range: ₹50 - ₹300 per ticket.\nShared Taxis: Common mode of transport for traveling between towns and neighboring states. Price range: ₹50 - ₹500 per trip."
            ],
            "context": [""]
        },
        
        {
            "tag": "Odisha",
            "patterns": ["Tell me about Odisha"],
            "responses": ["Odisha, located on the eastern coast of India, is known for its rich history, ancient temples, and vibrant culture. The state is home to attractions like the Konark Sun Temple, Jagannath Temple in Puri, Chilika Lake (the largest brackish water lagoon in Asia), and the tribal villages of Koraput. Odisha offers experiences like beach holidays, temple tours, and witnessing traditional Odissi dance performances."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Odisha",
            "patterns": [
                "Tell me about famous hotels in Odisha",
                "Which are the best hotels in Odisha?",
                "Can you recommend some popular hotels in Odisha?"
            ],
            "responses": [
                "Here are some famous hotels in Odisha: Mayfair Lagoon, Bhubaneswar - A luxury resort offering world-class amenities and fine dining options. Trident, Bhubaneswar - Known for its elegant design and impeccable service. The Crown, Bhubaneswar - A centrally located hotel offering convenience and warm hospitality."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Odisha",
            "patterns": [
                "What are some famous dishes from Odisha?",
                "Tell me about the popular food in Odisha.",
                "Can you recommend some traditional Odia cuisine?"
            ],
            "responses": [
                "Certainly! Odisha offers a delightful array of traditional dishes. Some iconic ones include Pakhala Bhata (fermented rice dish), Dalma (a mixed lentil and vegetable curry), Chhena Poda (a sweet made from cottage cheese), Macha Besara (fish cooked with mustard paste), and Rasabali (sweet dumplings in thickened milk). These are just a few examples of the delicious cuisine you can savor in Odisha, reflecting its rich cultural heritage and culinary traditions."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Odisha",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Odisha?",
                "What are the accommodation options and prices in Odisha?",
                "I'm looking for rooms to stay in Odisha. What are the rates?",
                "What are the prices of rooms available in Odisha?",
                "How much do rooms cost per night in Odisha?",
                "What are the rates for different types of rooms in Odisha?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Odisha: Budget Room: Starting from ₹1000 per night, Standard Room: Starting from ₹2500 per night, Deluxe Room: Starting from ₹4500 per night, Suite: Starting from ₹9000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Odisha",
            "patterns": [
                "What are the transportation options available in Odisha?",
                "How can I travel around Odisha?",
                "Can you tell me about different modes of transportation in Odisha?"
            ],
            "responses": [
                "You can explore Odisha using various transportation options:\n\nPrivate Taxis: Available for city travel and exploring tourist attractions. Price range: ₹800 - ₹2000 per day.\nState Buses: Economical option for inter-city travel with extensive routes. Price range: ₹50 - ₹500 per ticket.\nTrains: Indian Railways connects major cities and towns within the state. Price range: ₹100 - ₹2000 per ticket.\nAuto-rickshaws: Ideal for short trips within cities, but fares may vary."
            ],
            "context": [""]
        },
        
        {
            "tag": "Punjab",
            "patterns": ["Tell me about Punjab"],
            "responses": ["Punjab, located in northern India, is known for its fertile plains, vibrant culture, and historic landmarks. The state is home to attractions like the Golden Temple in Amritsar, Wagah Border ceremony, and Jallianwala Bagh. Punjab offers experiences like exploring ancient forts, indulging in Punjabi cuisine, and attending colorful festivals like Baisakhi."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Punjab",
            "patterns": [
                "Tell me about famous hotels in Punjab",
                "Which are the best hotels in Punjab?",
                "Can you recommend some popular hotels in Punjab?"
            ],
            "responses": [
                "Here are some famous hotels in Punjab: Taj Swarna, Amritsar - A luxury hotel offering world-class amenities and fine dining options. JW Marriott, Chandigarh - Known for its elegant design and impeccable service. Radisson Blu Hotel MBD Ludhiana - A centrally located hotel offering convenience and warm hospitality."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Punjab",
            "patterns": [
                "What are some famous dishes from Punjab?",
                "Tell me about the popular food in Punjab.",
                "Can you recommend some traditional Punjabi cuisine?"
            ],
            "responses": [
                "Of course! Punjab is known for its rich and flavorful cuisine. Some iconic dishes include Butter Chicken, Sarson da Saag with Makki di Roti (mustard greens with cornbread), Chole Bhature (chickpea curry with fried bread), Tandoori Chicken, and Paneer Tikka. These are just a few examples of the mouthwatering dishes you can savor in Punjab, reflecting its vibrant culture and culinary heritage."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Punjab",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Punjab?",
                "What are the accommodation options and prices in Punjab?",
                "I'm looking for rooms to stay in Punjab. What are the rates?",
                "What are the prices of rooms available in Punjab?",
                "How much do rooms cost per night in Punjab?",
                "What are the rates for different types of rooms in Punjab?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Punjab: Budget Room: Starting from ₹1000 per night, Standard Room: Starting from ₹2500 per night, Deluxe Room: Starting from ₹4500 per night, Suite: Starting from ₹9000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Punjab",
            "patterns": [
                "What are the transportation options available in Punjab?",
                "How can I travel around Punjab?",
                "Can you tell me about different modes of transportation in Punjab?"
            ],
            "responses": [
                "You can explore Punjab using various transportation options:\n\nPrivate Taxis: Available for city travel and exploring tourist attractions. Price range: ₹800 - ₹2000 per day.\nState Buses: Economical option for inter-city travel with extensive routes. Price range: ₹50 - ₹500 per ticket.\nTrains: Indian Railways connects major cities and towns within the state. Price range: ₹100 - ₹2000 per ticket.\nAuto-rickshaws: Ideal for short trips within cities, but fares may vary."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rajasthan",
            "patterns": ["Tell me about Rajasthan"],
            "responses": ["Rajasthan, known as the 'Land of Kings', is famous for its royal heritage, majestic forts, and vibrant culture. The state is home to attractions like Jaipur (the Pink City), Udaipur (the City of Lakes), Jaisalmer (the Golden City), and the Ranthambore National Park. Rajasthan offers experiences like camel safaris, heritage walks, and staying in luxurious palaces."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Rajasthan",
            "patterns": [
                "Tell me about famous hotels in Rajasthan",
                "Which are the best hotels in Rajasthan?",
                "Can you recommend some popular hotels in Rajasthan?"
            ],
            "responses": [
                "Here are some famous hotels in Rajasthan: The Taj Lake Palace, Udaipur - A luxurious hotel located on an island in Lake Pichola. The Rambagh Palace, Jaipur - A magnificent palace turned luxury hotel known for its opulence. The Oberoi Udaivilas, Udaipur - A stunning hotel set on the banks of Lake Pichola offering royal experiences."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Rajasthan",
            "patterns": [
                "What are some famous dishes from Rajasthan?",
                "Tell me about the popular food in Rajasthan.",
                "Can you recommend some traditional Rajasthani cuisine?"
            ],
            "responses": [
                "Certainly! Rajasthan is known for its rich and flavorful cuisine. Some iconic dishes include Dal Baati Churma (lentil curry with baked dough balls and sweetened crushed wheat), Gatte ki Sabzi (gram flour dumplings in curry), Laal Maas (spicy mutton curry), Ker Sangri (a desert berry and bean dish), and Mohanthal (a sweet made from gram flour and ghee). These are just a few examples of the delicious cuisine you can savor in Rajasthan, reflecting its vibrant culture and culinary heritage."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Rajasthan",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Rajasthan?",
                "What are the accommodation options and prices in Rajasthan?",
                "I'm looking for rooms to stay in Rajasthan. What are the rates?",
                "What are the prices of rooms available in Rajasthan?",
                "How much do rooms cost per night in Rajasthan?",
                "What are the rates for different types of rooms in Rajasthan?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Rajasthan: Budget Room: Starting from ₹1500 per night, Standard Room: Starting from ₹3500 per night, Deluxe Room: Starting from ₹6000 per night, Suite: Starting from ₹12000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Rajasthan",
            "patterns": [
                "What are the transportation options available in Rajasthan?",
                "How can I travel around Rajasthan?",
                "Can you tell me about different modes of transportation in Rajasthan?"
            ],
            "responses": [
                "You can explore Rajasthan using various transportation options:\n\nPrivate Taxis: Available for city travel and exploring tourist attractions. Price range: ₹1000 - ₹3000 per day.\nState Buses: Economical option for inter-city travel with extensive routes. Price range: ₹100 - ₹1000 per ticket.\nTrains: Indian Railways connects major cities and towns within the state. Price range: ₹100 - ₹2000 per ticket.\nAuto-rickshaws: Ideal for short trips within cities, but fares may vary."
            ],
            "context": [""]
        },
        
        {
            "tag": "Sikkim",
            "patterns": ["Tell me about Sikkim"],
            "responses": ["Sikkim, nestled in the Himalayas, is known for its pristine beauty, Buddhist monasteries, and adventure sports. The state is home to attractions like Gurudongmar Lake, Tsomgo Lake, Nathu La Pass, and the Rumtek Monastery. Sikkim offers experiences like trekking in the Himalayas, witnessing colorful Buddhist festivals, and exploring alpine forests."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Sikkim",
            "patterns": [
                "Tell me about famous hotels in Sikkim",
                "Which are the best hotels in Sikkim?",
                "Can you recommend some popular hotels in Sikkim?"
            ],
            "responses": [
                "Here are some famous hotels in Sikkim: Mayfair Spa Resort & Casino, Gangtok - A luxury resort offering world-class amenities and panoramic views of the Himalayas. The Elgin Nor-Khill, Gangtok - A heritage hotel known for its elegant architecture and warm hospitality. The Royal Plaza, Gangtok - A centrally located hotel offering convenience and comfortable accommodations."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Sikkim",
            "patterns": [
                "What are some famous dishes from Sikkim?",
                "Tell me about the popular food in Sikkim.",
                "Can you recommend some traditional Sikkimese cuisine?"
            ],
            "responses": [
                "Absolutely! Sikkim offers a diverse range of traditional dishes. Some iconic ones include Momos (dumplings filled with meat or vegetables), Thukpa (noodle soup with vegetables or meat), Gundruk (fermented leafy greens), Sinki (fermented radish), and Phagshapa (pork cooked with radish and dried chili). These are just a few examples of the delicious cuisine you can savor in Sikkim, reflecting its rich cultural heritage and culinary traditions."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Sikkim",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Sikkim?",
                "What are the accommodation options and prices in Sikkim?",
                "I'm looking for rooms to stay in Sikkim. What are the rates?",
                "What are the prices of rooms available in Sikkim?",
                "How much do rooms cost per night in Sikkim?",
                "What are the rates for different types of rooms in Sikkim?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Sikkim: Budget Room: Starting from ₹1500 per night, Standard Room: Starting from ₹3000 per night, Deluxe Room: Starting from ₹5000 per night, Suite: Starting from ₹10000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Sikkim",
            "patterns": [
                "What are the transportation options available in Sikkim?",
                "How can I travel around Sikkim?",
                "Can you tell me about different modes of transportation in Sikkim?"
            ],
            "responses": [
                "You can explore Sikkim using various transportation options:\n\nPrivate Taxis: Available for city travel and exploring tourist attractions. Price range: ₹1000 - ₹3000 per day.\nState Buses: Limited but available for inter-city travel. Price range: ₹50 - ₹300 per ticket.\nShared Taxis: Common mode of transport for traveling between towns and neighboring states. Price range: ₹50 - ₹500 per trip.\nJeeps: Ideal for traveling to remote areas and mountainous terrain. Price range: ₹1000 - ₹5000 per trip."
            ],
            "context": [""]
        },
        
        {
            "tag": "Tamil Nadu",
            "patterns": ["Tell me about Tamil Nadu"],
            "responses": ["Tamil Nadu, located in southern India, is known for its ancient temples, rich culture, and classical dance forms. The state is home to attractions like the Meenakshi Temple in Madurai, Brihadeeswarar Temple in Thanjavur, Marina Beach in Chennai, and the hill station of Ooty. Tamil Nadu offers experiences like temple tours, traditional music and dance performances, and exploring colonial heritage."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Tamil_Nadu",
            "patterns": [
                "Tell me about famous hotels in Tamil Nadu",
                "Which are the best hotels in Tamil Nadu?",
                "Can you recommend some popular hotels in Tamil Nadu?"
            ],
            "responses": [
                "Here are some famous hotels in Tamil Nadu: Taj Coromandel, Chennai - A luxury hotel offering world-class amenities and fine dining options. The Leela Palace, Chennai - Known for its elegant design and impeccable service. Vivanta by Taj - Fisherman's Cove, Chennai - A beachfront resort offering serene surroundings and luxurious accommodations."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Tamil_Nadu",
            "patterns": [
                "What are some famous dishes from Tamil Nadu?",
                "Tell me about the popular food in Tamil Nadu.",
                "Can you recommend some traditional Tamil cuisine?"
            ],
            "responses": [
                "Certainly! Tamil Nadu is known for its rich and flavorful cuisine. Some iconic dishes include Dosa (fermented rice and lentil crepe), Idli (steamed rice cake), Sambar (lentil-based vegetable stew), Rasam (spicy soup), and Pongal (rice and lentil dish). These are just a few examples of the delicious cuisine you can savor in Tamil Nadu, reflecting its vibrant culture and culinary heritage."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Tamil_Nadu",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Tamil Nadu?",
                "What are the accommodation options and prices in Tamil Nadu?",
                "I'm looking for rooms to stay in Tamil Nadu. What are the rates?",
                "What are the prices of rooms available in Tamil Nadu?",
                "How much do rooms cost per night in Tamil Nadu?",
                "What are the rates for different types of rooms in Tamil Nadu?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Tamil Nadu: Budget Room: Starting from ₹1500 per night, Standard Room: Starting from ₹3500 per night, Deluxe Room: Starting from ₹6000 per night, Suite: Starting from ₹12000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Tamil_Nadu",
            "patterns": [
                "What are the transportation options available in Tamil Nadu?",
                "How can I travel around Tamil Nadu?",
                "Can you tell me about different modes of transportation in Tamil Nadu?"
            ],
            "responses": [
                "You can explore Tamil Nadu using various transportation options:\n\nLocal Trains: Suburban trains are available in major cities like Chennai for convenient city travel. Price range: ₹5 - ₹100 per ticket.\nState Buses: Tamil Nadu State Transport Corporation (TNSTC) operates buses across the state. Price range: ₹20 - ₹1000 per ticket.\nPrivate Taxis: Available for city travel and exploring tourist attractions. Price range: ₹800 - ₹3000 per day.\nAuto-rickshaws: Ideal for short trips within cities, but fares may vary."
            ],
            "context": [""]
        },
        
        {
            "tag": "Telangana",
            "patterns": ["Tell me about Telangana"],
            "responses": ["Telangana, located in southern India, is known for its rich history, architectural wonders, and cultural heritage. The state is home to attractions like the Charminar, Golconda Fort, Ramoji Film City, and the historic city of Warangal. Telangana offers experiences like exploring ancient monuments, witnessing vibrant festivals, and savoring Hyderabadi cuisine."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Telangana",
            "patterns": [
                "Tell me about famous hotels in Telangana",
                "Which are the best hotels in Telangana?",
                "Can you recommend some popular hotels in Telangana?"
            ],
            "responses": [
                "Here are some famous hotels in Telangana: Taj Falaknuma Palace, Hyderabad - A luxurious palace turned hotel offering royal experiences. Novotel Hyderabad Convention Centre - A contemporary hotel located near HITEC City offering modern amenities. Park Hyatt Hyderabad - Known for its elegant design and impeccable service."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Telangana",
            "patterns": [
                "What are some famous dishes from Telangana?",
                "Tell me about the popular food in Telangana.",
                "Can you recommend some traditional Telangana cuisine?"
            ],
            "responses": [
                "Of course! Telangana offers a diverse range of traditional dishes. Some iconic ones include Hyderabadi Biryani, Mirchi Bajji (stuffed chili fritters), Gongura Pachadi (sorrel leaves chutney), Pesarattu (green gram dosa), and Qubani Ka Meetha (apricot dessert). These are just a few examples of the delicious cuisine you can savor in Telangana, reflecting its rich culinary heritage and cultural diversity."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Telangana",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Telangana?",
                "What are the accommodation options and prices in Telangana?",
                "I'm looking for rooms to stay in Telangana. What are the rates?",
                "What are the prices of rooms available in Telangana?",
                "How much do rooms cost per night in Telangana?",
                "What are the rates for different types of rooms in Telangana?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Telangana: Budget Room: Starting from ₹2000 per night, Standard Room: Starting from ₹4000 per night, Deluxe Room: Starting from ₹7000 per night, Suite: Starting from ₹14000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Telangana",
            "patterns": [
                "What are the transportation options available in Telangana?",
                "How can I travel around Telangana?",
                "Can you tell me about different modes of transportation in Telangana?"
            ],
            "responses": [
                "You can explore Telangana using various transportation options:\n\nPrivate Taxis: Convenient for city travel and short distances. Price range: ₹800 - ₹1500 per day.\nState Buses: Economical option for inter-city travel with extensive routes. Price range: ₹200 - ₹600 per ticket.\nTrains: Indian Railways connects major cities and towns within the state. Price range: ₹100 - ₹2000 per ticket.\nAuto-rickshaws: Ideal for short trips within cities, but fares may vary."
            ],
            "context": [""]
        },
        
        {
            "tag": "Tripura",
            "patterns": ["Tell me about Tripura"],
            "responses": ["Tripura, located in northeastern India, is known for its scenic beauty, diverse tribal culture, and historic sites. The state is home to attractions like the Ujjayanta Palace, Neermahal Palace, and the ancient temples of Unakoti. Tripura offers experiences like exploring lush green valleys, visiting traditional tribal villages, and participating in colorful festivals."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Tripura",
            "patterns": [
                "Tell me about famous hotels in Tripura",
                "Which are the best hotels in Tripura?",
                "Can you recommend some popular hotels in Tripura?"
            ],
            "responses": [
                "Here are some famous hotels in Tripura: Ginger Hotel, Agartala - A centrally located hotel offering convenience and comfortable accommodations. Hotel City Centre, Agartala - Known for its warm hospitality and convenient location. The Rajbari Bawali, Kolkata - A luxurious heritage hotel located near Tripura border, offering a blend of traditional and modern amenities."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Tripura",
            "patterns": [
                "What are some famous dishes from Tripura?",
                "Tell me about the popular food in Tripura.",
                "Can you recommend some traditional Tripuri cuisine?"
            ],
            "responses": [
                "Absolutely! Tripura offers a unique blend of flavors in its traditional cuisine. Some iconic dishes include Mosdeng Serma (fermented fish chutney), Muya Awandru (bamboo shoot curry), Wahan Mosdeng (smoked pork with chili), Chakhwi (mixed vegetable curry), and Gudok (pork cooked with bamboo shoot). These are just a few examples of the delicious cuisine you can savor in Tripura, reflecting its rich cultural heritage and culinary traditions."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Tripura",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Tripura?",
                "What are the accommodation options and prices in Tripura?",
                "I'm looking for rooms to stay in Tripura. What are the rates?",
                "What are the prices of rooms available in Tripura?",
                "How much do rooms cost per night in Tripura?",
                "What are the rates for different types of rooms in Tripura?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Tripura: Budget Room: Starting from ₹1000 per night, Standard Room: Starting from ₹2000 per night, Deluxe Room: Starting from ₹3500 per night, Suite: Starting from ₹7000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Tripura",
            "patterns": [
                "What are the transportation options available in Tripura?",
                "How can I travel around Tripura?",
                "Can you tell me about different modes of transportation in Tripura?"
            ],
            "responses": [
                "You can explore Tripura using various transportation options:\n\nTaxis: Available for city travel and exploring tourist attractions. Price range: ₹500 - ₹1500 per day.\nState Buses: Limited but available for inter-city travel. Price range: ₹50 - ₹300 per ticket.\nAuto-rickshaws: Ideal for short trips within cities, but fares may vary.\nShared Taxis: Common mode of transport for traveling between towns and neighboring states. Price range: ₹50 - ₹500 per trip."
            ],
            "context": [""]
        },
        
        {
            "tag": "Uttar Pradesh",
            "patterns": ["Tell me about Uttar Pradesh"],
            "responses": ["Uttar Pradesh, located in northern India, is known for its rich history, architectural marvels, and spiritual significance. The state is home to attractions like the Taj Mahal in Agra, Varanasi (one of the oldest inhabited cities in the world), and the holy city of Mathura. Uttar Pradesh offers experiences like heritage walks, boat rides on the Ganges, and attending colorful festivals."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Uttar_Pradesh",
            "patterns": [
                "Tell me about famous hotels in Uttar Pradesh",
                "Which are the best hotels in Uttar Pradesh?",
                "Can you recommend some popular hotels in Uttar Pradesh?"
            ],
            "responses": [
                "Here are some famous hotels in Uttar Pradesh: Taj Mahal Palace, Agra - A luxurious hotel offering world-class amenities and stunning views of the Taj Mahal. The Gateway Hotel, Agra - Known for its elegant design and impeccable service. Trident, Lucknow - A contemporary hotel offering modern amenities and warm hospitality."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Uttar_Pradesh",
            "patterns": [
                "What are some famous dishes from Uttar Pradesh?",
                "Tell me about the popular food in Uttar Pradesh.",
                "Can you recommend some traditional Uttar Pradesh cuisine?"
            ],
            "responses": [
                "Certainly! Uttar Pradesh offers a rich and diverse range of traditional dishes. Some iconic ones include Tunday Kababi (kebabs), Lucknowi Biryani, Aloo Dum (spicy potato curry), Bedmi Puri with Aloo Sabzi (fried bread with potato curry), and Rabri (sweet milk dessert). These are just a few examples of the delicious cuisine you can savor in Uttar Pradesh, reflecting its vibrant culture and culinary heritage."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Uttar_Pradesh",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Uttar Pradesh?",
                "What are the accommodation options and prices in Uttar Pradesh?",
                "I'm looking for rooms to stay in Uttar Pradesh. What are the rates?",
                "What are the prices of rooms available in Uttar Pradesh?",
                "How much do rooms cost per night in Uttar Pradesh?",
                "What are the rates for different types of rooms in Uttar Pradesh?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Uttar Pradesh: Budget Room: Starting from ₹1500 per night, Standard Room: Starting from ₹3000 per night, Deluxe Room: Starting from ₹5000 per night, Suite: Starting from ₹10000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Uttar_Pradesh",
            "patterns": [
                "What are the transportation options available in Uttar Pradesh?",
                "How can I travel around Uttar Pradesh?",
                "Can you tell me about different modes of transportation in Uttar Pradesh?"
            ],
            "responses": [
                "You can explore Uttar Pradesh using various transportation options:\n\nPrivate Taxis: Available for city travel and exploring tourist attractions. Price range: ₹1000 - ₹3000 per day.\nState Buses: Economical option for inter-city travel with extensive routes. Price range: ₹100 - ₹1000 per ticket.\nTrains: Indian Railways connects major cities and towns within the state. Price range: ₹100 - ₹2000 per ticket.\nAuto-rickshaws: Ideal for short trips within cities, but fares may vary."
            ],
            "context": [""]
        },
        
        {
            "tag": "Uttarakhand",
            "patterns": ["Tell me about Uttarakhand"],
            "responses": ["Uttarakhand, nestled in the Himalayas, is known for its stunning landscapes, pilgrimage sites, and adventure sports. The state is home to attractions like the hill stations of Nainital, Mussoorie, and Almora, the holy shrines of Badrinath and Kedarnath, and the Jim Corbett National Park. Uttarakhand offers experiences like trekking, river rafting, and exploring ancient temples."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Uttarakhand",
            "patterns": [
                "Tell me about famous hotels in Uttarakhand",
                "Which are the best hotels in Uttarakhand?",
                "Can you recommend some popular hotels in Uttarakhand?"
            ],
            "responses": [
                "Here are some famous hotels in Uttarakhand: The Oberoi Amarvilas, Agra - A luxurious hotel offering world-class amenities and stunning views of the Taj Mahal. Jaypee Residency Manor, Mussoorie - Known for its elegant design and panoramic views of the Himalayas. Ananda in the Himalayas, Rishikesh - A wellness retreat offering holistic experiences amidst serene surroundings."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Uttarakhand",
            "patterns": [
                "What are some famous dishes from Uttarakhand?",
                "Tell me about the popular food in Uttarakhand.",
                "Can you recommend some traditional Uttarakhand cuisine?"
            ],
            "responses": [
                "Of course! Uttarakhand offers a delightful array of traditional dishes. Some iconic ones include Aloo ke Gutke (spicy boiled potatoes), Kafuli (spinach gravy), Bal Mithai (sweet fudge), Chainsoo (black gram curry), and Gahat ki Dal (horse gram lentil). These are just a few examples of the delicious cuisine you can savor in Uttarakhand, reflecting its rich cultural heritage and culinary traditions."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Uttarakhand",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Uttarakhand?",
                "What are the accommodation options and prices in Uttarakhand?",
                "I'm looking for rooms to stay in Uttarakhand. What are the rates?",
                "What are the prices of rooms available in Uttarakhand?",
                "How much do rooms cost per night in Uttarakhand?",
                "What are the rates for different types of rooms in Uttarakhand?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Uttarakhand: Budget Room: Starting from ₹1500 per night, Standard Room: Starting from ₹3000 per night, Deluxe Room: Starting from ₹5000 per night, Suite: Starting from ₹10000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Uttarakhand",
            "patterns": [
                "What are the transportation options available in Uttarakhand?",
                "How can I travel around Uttarakhand?",
                "Can you tell me about different modes of transportation in Uttarakhand?"
            ],
            "responses": [
                "You can explore Uttarakhand using various transportation options:\n\nPrivate Taxis: Available for city travel and exploring tourist attractions. Price range: ₹1000 - ₹3000 per day.\nState Buses: Economical option for inter-city travel with extensive routes. Price range: ₹100 - ₹1000 per ticket.\nTrains: Indian Railways connects major cities and towns within the state. Price range: ₹100 - ₹2000 per ticket.\nAuto-rickshaws: Ideal for short trips within cities, but fares may vary."
            ],
            "context": [""]
        },
        
        {
            "tag": "West Bengal",
            "patterns": ["Tell me about West Bengal"],
            "responses": ["West Bengal, located in eastern India, is known for its cultural heritage, colonial architecture, and literary legacy. The state is home to attractions like Kolkata (the City of Joy), Darjeeling (famous for tea plantations and the Darjeeling Himalayan Railway), Sundarbans National Park, and Victoria Memorial. West Bengal offers experiences like exploring bustling markets, attending cultural festivals, and enjoying delectable Bengali cuisine."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_West_Bengal",
            "patterns": [
                "Tell me about famous hotels in West Bengal",
                "Which are the best hotels in West Bengal?",
                "Can you recommend some popular hotels in West Bengal?"
            ],
            "responses": [
                "Here are some famous hotels in West Bengal: The Oberoi Grand, Kolkata - A luxurious heritage hotel offering world-class amenities and colonial charm. Taj Bengal, Kolkata - Known for its elegant design and impeccable service. The Elgin, Darjeeling - A heritage hotel located amidst serene surroundings offering a blend of traditional and modern amenities."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_West_Bengal",
            "patterns": [
                "What are some famous dishes from West Bengal?",
                "Tell me about the popular food in West Bengal.",
                "Can you recommend some traditional Bengali cuisine?"
            ],
            "responses": [
                "Absolutely! West Bengal is known for its rich and diverse cuisine. Some iconic dishes include Fish Curry (such as Hilsa or Rohu), Kosha Mangsho (spicy Bengali mutton curry), Shorshe Ilish (Hilsa fish cooked in mustard gravy), Chingri Malai Curry (prawn curry with coconut milk), and Mishti Doi (sweetened yogurt). These are just a few examples of the mouthwatering dishes you can savor in West Bengal, reflecting its vibrant culture and culinary heritage."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_West_Bengal",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in West Bengal?",
                "What are the accommodation options and prices in West Bengal?",
                "I'm looking for rooms to stay in West Bengal. What are the rates?",
                "What are the prices of rooms available in West Bengal?",
                "How much do rooms cost per night in West Bengal?",
                "What are the rates for different types of rooms in West Bengal?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in West Bengal: Budget Room: Starting from ₹1500 per night, Standard Room: Starting from ₹3000 per night, Deluxe Room: Starting from ₹5000 per night, Suite: Starting from ₹10000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_West_Bengal",
            "patterns": [
                "What are the transportation options available in West Bengal?",
                "How can I travel around West Bengal?",
                "Can you tell me about different modes of transportation in West Bengal?"
            ],
            "responses": [
                "You can explore West Bengal using various transportation options:\n\nLocal Trains: Suburban trains are available in major cities like Kolkata for convenient city travel. Price range: ₹5 - ₹100 per ticket.\nState Buses: West Bengal Surface Transport Corporation (WBSTC) operates buses across the state. Price range: ₹20 - ₹1000 per ticket.\nPrivate Taxis: Available for city travel and exploring tourist attractions. Price range: ₹800 - ₹3000 per day.\nAuto-rickshaws: Ideal for short trips within cities, but fares may vary."
            ],
            "context": [""]
        },
        

        {
            "tag": "Andaman and Nicobar Islands",
            "patterns": ["Tell me about Andaman and Nicobar Islands"],
            "responses": ["The Andaman and Nicobar Islands, located in the Bay of Bengal, are known for their pristine beaches, lush greenery, and diverse marine life. The archipelago is home to attractions like Radhanagar Beach (voted as one of the best beaches in Asia), Cellular Jail National Memorial, and Havelock Island. Andaman and Nicobar Islands offer experiences like scuba diving, snorkeling, and exploring uninhabited islands."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Andaman_Nicobar",
            "patterns": [
                "Tell me about famous hotels in Andaman and Nicobar Islands",
                "Which are the best hotels in Andaman and Nicobar Islands?",
                "Can you recommend some popular hotels in Andaman and Nicobar Islands?"
            ],
            "responses": [
                "Here are some famous hotels in Andaman and Nicobar Islands: Barefoot at Havelock - A luxurious eco-friendly resort offering beachfront cottages. SeaShell, Neil Island - Known for its serene location and comfortable accommodations. Munjoh Ocean Resort, Havelock - Offers private beach access and modern amenities for a relaxing stay."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Andaman_Nicobar",
            "patterns": [
                "What are some famous dishes from Andaman and Nicobar Islands?",
                "Tell me about the popular food in Andaman and Nicobar Islands.",
                "Can you recommend some traditional cuisine from Andaman and Nicobar Islands?"
            ],
            "responses": [
                "Certainly! Andaman and Nicobar Islands offer a delightful array of traditional dishes. Some iconic ones include Seafood Curries (featuring fresh catches like crab, fish, and prawns), Coconut-based Dishes (such as Coconut Prawn Curry or Coconut Fish Curry), Fish Tikka, Andaman Fish Roe Curry, and Banana Chips. These are just a few examples of the delicious cuisine you can savor in Andaman and Nicobar Islands, reflecting its coastal culture and diverse culinary traditions."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Andaman_Nicobar",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Andaman and Nicobar Islands?",
                "What are the accommodation options and prices in Andaman and Nicobar Islands?",
                "I'm looking for rooms to stay in Andaman and Nicobar Islands. What are the rates?",
                "What are the prices of rooms available in Andaman and Nicobar Islands?",
                "How much do rooms cost per night in Andaman and Nicobar Islands?",
                "What are the rates for different types of rooms in Andaman and Nicobar Islands?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Andaman and Nicobar Islands: Budget Room: Starting from ₹3000 per night, Standard Room: Starting from ₹5000 per night, Deluxe Room: Starting from ₹8000 per night, Suite: Starting from ₹12000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Andaman_Nicobar",
            "patterns": [
                "What are the transportation options available in Andaman and Nicobar Islands?",
                "How can I travel around Andaman and Nicobar Islands?",
                "Can you tell me about different modes of transportation in Andaman and Nicobar Islands?"
            ],
            "responses": [
                "You can explore Andaman and Nicobar Islands using various transportation options:\n\nFerries: The primary mode of transportation between islands. Price range: ₹200 - ₹1500 per ticket.\nPrivate Taxis: Available for city travel and exploring tourist attractions. Price range: ₹1500 - ₹3000 per day.\nAuto-rickshaws: Ideal for short trips within cities, but fares may vary.\nScooter/Bike Rentals: Available for daily hire, ideal for exploring the islands at your own pace. Price range: ₹500 - ₹1000 per day."
            ],
            "context": [""]
        },
        
        {
            "tag": "Chandigarh",
            "patterns": ["Tell me about Chandigarh"],
            "responses": ["Chandigarh, a union territory and capital of Punjab and Haryana, is known for its modern architecture, well-planned layout, and lush green gardens. The city is home to attractions like the Rock Garden, Sukhna Lake, and the Capitol Complex. Chandigarh offers experiences like boating, shopping at vibrant markets, and enjoying the vibrant nightlife."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Chandigarh",
            "patterns": [
                "Tell me about famous hotels in Chandigarh",
                "Which are the best hotels in Chandigarh?",
                "Can you recommend some popular hotels in Chandigarh?"
            ],
            "responses": [
                "Here are some famous hotels in Chandigarh: Taj Chandigarh - A luxury hotel offering world-class amenities and exquisite dining options. The Lalit Chandigarh - Known for its modern architecture and impeccable service. JW Marriott Hotel Chandigarh - Offers elegant rooms, multiple dining options, and a rooftop pool."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Chandigarh",
            "patterns": [
                "What are some famous dishes from Chandigarh?",
                "Tell me about the popular food in Chandigarh.",
                "Can you recommend some traditional Chandigarhi cuisine?"
            ],
            "responses": [
                "Certainly! Chandigarh offers a diverse range of culinary delights. Some iconic dishes include Butter Chicken, Chole Bhature, Amritsari Kulcha, Tandoori Chicken, and Rajma Chawal. These are just a few examples of the delicious cuisine you can savor in Chandigarh, reflecting its rich culinary heritage and cultural diversity."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Chandigarh",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Chandigarh?",
                "What are the accommodation options and prices in Chandigarh?",
                "I'm looking for rooms to stay in Chandigarh. What are the rates?",
                "What are the prices of rooms available in Chandigarh?",
                "How much do rooms cost per night in Chandigarh?",
                "What are the rates for different types of rooms in Chandigarh?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Chandigarh: Budget Room: Starting from ₹2000 per night, Standard Room: Starting from ₹4000 per night, Deluxe Room: Starting from ₹7000 per night, Suite: Starting from ₹12000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Chandigarh",
            "patterns": [
                "What are the transportation options available in Chandigarh?",
                "How can I travel around Chandigarh?",
                "Can you tell me about different modes of transportation in Chandigarh?"
            ],
            "responses": [
                "You can explore Chandigarh using various transportation options:\n\nPrivate Taxis: Available for city travel and exploring tourist attractions. Price range: ₹1000 - ₹2500 per day.\nLocal Buses: Chandigarh Transport Undertaking (CTU) operates buses across the city. Price range: ₹10 - ₹50 per ticket.\nAuto-rickshaws: Ideal for short trips within the city, but fares may vary.\nBicycle Rentals: Available for daily hire, ideal for exploring the city's well-planned roads and parks. Price range: ₹50 - ₹200 per day."
            ],
            "context": [""]
        },
        
        {
            "tag": "Dadra and Nagar Haveli and Daman and Diu",
            "patterns": ["Tell me about Dadra and Nagar Haveli and Daman and Diu"],
            "responses": ["Dadra and Nagar Haveli and Daman and Diu, a union territory in western India, is known for its serene beaches, colonial heritage, and scenic landscapes. The territory is home to attractions like the Diu Fort, Naida Caves, and the tranquil beaches of Devka and Jampore. Dadra and Nagar Haveli and Daman and Diu offer experiences like water sports, island hopping, and exploring Portuguese architecture."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Dadra_Nagar_Haveli_Daman_Diu",
            "patterns": [
                "Tell me about famous hotels in Dadra and Nagar Haveli and Daman and Diu",
                "Which are the best hotels in Dadra and Nagar Haveli and Daman and Diu?",
                "Can you recommend some popular hotels in Dadra and Nagar Haveli and Daman and Diu?"
            ],
            "responses": [
                "Here are some famous hotels in Dadra and Nagar Haveli and Daman and Diu: The Deltin, Daman - A luxury hotel offering modern amenities, a casino, and multiple dining options. Treat Resort, Silvassa - Known for its spacious accommodations and recreational facilities. Radhika Beach Resort, Diu - Offers beachfront views, comfortable rooms, and a relaxing atmosphere."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Dadra_Nagar_Haveli_Daman_Diu",
            "patterns": [
                "What are some famous dishes from Dadra and Nagar Haveli and Daman and Diu?",
                "Tell me about the popular food in Dadra and Nagar Haveli and Daman and Diu.",
                "Can you recommend some traditional cuisine from Dadra and Nagar Haveli and Daman and Diu?"
            ],
            "responses": [
                "Certainly! Dadra and Nagar Haveli and Daman and Diu offer a mix of traditional and modern cuisine. Some popular dishes include Seafood (such as Fish Curry, Prawn Masala, and Crab Xec Xec), Vindaloo (a spicy meat dish), Feni (a local spirit), Bebinca (a traditional Goan dessert), and Dhokla. These are just a few examples of the delicious cuisine you can savor in Dadra and Nagar Haveli and Daman and Diu, reflecting its coastal culture and diverse culinary influences."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Dadra_Nagar_Haveli_Daman_Diu",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Dadra and Nagar Haveli and Daman and Diu?",
                "What are the accommodation options and prices in Dadra and Nagar Haveli and Daman and Diu?",
                "I'm looking for rooms to stay in Dadra and Nagar Haveli and Daman and Diu. What are the rates?",
                "What are the prices of rooms available in Dadra and Nagar Haveli and Daman and Diu?",
                "How much do rooms cost per night in Dadra and Nagar Haveli and Daman and Diu?",
                "What are the rates for different types of rooms in Dadra and Nagar Haveli and Daman and Diu?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Dadra and Nagar Haveli and Daman and Diu: Budget Room: Starting from ₹2000 per night, Standard Room: Starting from ₹4000 per night, Deluxe Room: Starting from ₹6000 per night, Suite: Starting from ₹10000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Dadra_Nagar_Haveli_Daman_Diu",
            "patterns": [
                "What are the transportation options available in Dadra and Nagar Haveli and Daman and Diu?",
                "How can I travel around Dadra and Nagar Haveli and Daman and Diu?",
                "Can you tell me about different modes of transportation in Dadra and Nagar Haveli and Daman and Diu?"
            ],
            "responses": [
                "You can explore Dadra and Nagar Haveli and Daman and Diu using various transportation options:\n\nPrivate Taxis: Available for city travel and exploring tourist attractions. Price range: ₹1000 - ₹2500 per day.\nLocal Buses: Operate within and between the territories. Price range: ₹20 - ₹100 per ticket.\nAuto-rickshaws: Ideal for short trips within towns, but fares may vary.\nBicycle and Scooter Rentals: Available for daily hire, ideal for exploring the areas at your own pace. Price range: ₹300 - ₹1000 per day."
            ],
            "context": [""]
        },
        
        {
            "tag": "Lakshadweep",
            "patterns": ["Tell me about Lakshadweep"],
            "responses": ["Lakshadweep, located in the Arabian Sea, is known for its pristine coral reefs, turquoise waters, and sandy beaches. The archipelago is home to attractions like Agatti Island, Bangaram Island, and Kadmat Island. Lakshadweep offers experiences like scuba diving, snorkeling, and beach camping amidst breathtaking natural beauty."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Lakshadweep",
            "patterns": [
                "Tell me about famous hotels in Lakshadweep",
                "Which are the best hotels in Lakshadweep?",
                "Can you recommend some popular hotels in Lakshadweep?"
            ],
            "responses": [
                "Here are some famous hotels in Lakshadweep: Bangaram Island Resort - A luxury resort offering beautiful beachfront views and various water sports activities. Agatti Island Beach Resort - Known for its pristine beaches and comfortable accommodations. Coral Reef Resort, Kavaratti - Offers modern amenities and easy access to beautiful coral reefs."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Lakshadweep",
            "patterns": [
                "What are some famous dishes from Lakshadweep?",
                "Tell me about the popular food in Lakshadweep.",
                "Can you recommend some traditional Lakshadweep cuisine?"
            ],
            "responses": [
                "Absolutely! Lakshadweep offers a delightful array of traditional dishes, largely focused on seafood. Some iconic ones include Tuna Curry, Octopus Masala, Lobster Gravy, Coconut Rice, and Banana Chips. These are just a few examples of the delicious cuisine you can savor in Lakshadweep, reflecting its coastal culture and abundant seafood resources."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Lakshadweep",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Lakshadweep?",
                "What are the accommodation options and prices in Lakshadweep?",
                "I'm looking for rooms to stay in Lakshadweep. What are the rates?",
                "What are the prices of rooms available in Lakshadweep?",
                "How much do rooms cost per night in Lakshadweep?",
                "What are the rates for different types of rooms in Lakshadweep?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Lakshadweep: Budget Room: Starting from ₹5000 per night, Standard Room: Starting from ₹8000 per night, Deluxe Room: Starting from ₹12000 per night, Suite: Starting from ₹20000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Lakshadweep",
            "patterns": [
                "What are the transportation options available in Lakshadweep?",
                "How can I travel around Lakshadweep?",
                "Can you tell me about different modes of transportation in Lakshadweep?"
            ],
            "responses": [
                "You can explore Lakshadweep using various transportation options:\n\nFerries: The primary mode of transportation between islands. Price range: ₹500 - ₹3000 per ticket.\nPrivate Boats: Available for hire to explore nearby islands and reefs. Price range: ₹2000 - ₹8000 per trip.\nHelicopter Services: Available for quick and scenic travel between islands. Price range: ₹5000 - ₹15000 per ticket.\nBicycles: Available for rent on some islands, ideal for exploring at a leisurely pace. Price range: ₹100 - ₹500 per day."
            ],
            "context": [""]
        },
        
        {
            "tag": "Delhi",
            "patterns": ["Tell me about Delhi"],
            "responses": ["Delhi, the capital of India, is a vibrant metropolis known for its rich history, cultural diversity, and modern amenities. The city is home to attractions like the Red Fort, India Gate, Qutub Minar, and Jama Masjid. Delhi offers experiences like heritage walks, street food tours, and exploring bustling markets like Chandni Chowk."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Delhi",
            "patterns": [
                "Tell me about famous hotels in Delhi",
                "Which are the best hotels in Delhi?",
                "Can you recommend some popular hotels in Delhi?"
            ],
            "responses": [
                "Here are some famous hotels in Delhi: The Oberoi, New Delhi - A luxurious hotel offering world-class amenities and exquisite dining options. Taj Mahal Hotel, New Delhi - Known for its elegant design and impeccable service. The Leela Palace, New Delhi - Offers opulent rooms, multiple dining options, and a relaxing spa."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Delhi",
            "patterns": [
                "What are some famous dishes from Delhi?",
                "Tell me about the popular food in Delhi.",
                "Can you recommend some traditional Delhi cuisine?"
            ],
            "responses": [
                "Certainly! Delhi is known for its diverse and flavorful cuisine. Some iconic dishes include Chole Bhature, Butter Chicken, Aloo Tikki, Paratha with Paneer or Aloo, and Chaat (such as Golgappa, Papdi Chaat, and Dahi Bhalla). These are just a few examples of the mouthwatering dishes you can savor in Delhi, reflecting its vibrant culture and culinary heritage."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Delhi",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Delhi?",
                "What are the accommodation options and prices in Delhi?",
                "I'm looking for rooms to stay in Delhi. What are the rates?",
                "What are the prices of rooms available in Delhi?",
                "How much do rooms cost per night in Delhi?",
                "What are the rates for different types of rooms in Delhi?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Delhi: Budget Room: Starting from ₹2500 per night, Standard Room: Starting from ₹5000 per night, Deluxe Room: Starting from ₹8000 per night, Suite: Starting from ₹15000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Delhi",
            "patterns": [
                "What are the transportation options available in Delhi?",
                "How can I travel around Delhi?",
                "Can you tell me about different modes of transportation in Delhi?"
            ],
            "responses": [
                "You can explore Delhi using various transportation options:\n\nDelhi Metro: A fast and convenient way to travel around the city. Price range: ₹10 - ₹60 per ticket.\nAuto-rickshaws: Ideal for short trips within the city, but fares may vary.\nPrivate Taxis: Available for city travel and exploring tourist attractions. Price range: ₹1000 - ₹3000 per day.\nBuses: Delhi Transport Corporation (DTC) operates buses across the city. Price range: ₹10 - ₹50 per ticket.\nCycle Rickshaws: Available in some areas for short distances. Price range: ₹20 - ₹100 per trip."
            ],
            "context": [""]
        },
        
        {
            "tag": "Puducherry",
            "patterns": ["Tell me about Puducherry"],
            "responses": ["Puducherry, also known as Pondicherry, is a charming union territory known for its French colonial heritage, serene beaches, and spiritual atmosphere. The territory is home to attractions like the Auroville Ashram, Promenade Beach, Auroville Beach, and the French Quarter. Puducherry offers experiences like heritage walks, meditation sessions, and French cuisine."],
            "context": [""]
        },
        {
            "tag": "Famous_Hotels_Puducherry",
            "patterns": [
                "Tell me about famous hotels in Puducherry",
                "Which are the best hotels in Puducherry?",
                "Can you recommend some popular hotels in Puducherry?"
            ],
            "responses": [
                "Here are some famous hotels in Puducherry: The Promenade - A luxurious beachfront hotel offering world-class amenities and beautiful sea views. Palais de Mahe - Known for its colonial architecture and elegant accommodations. Le Pondy - A resort that offers a perfect blend of traditional and modern amenities along with beach access."
            ],
            "context": [""]
        },
        {
            "tag": "Famous_Food_Puducherry",
            "patterns": [
                "What are some famous dishes from Puducherry?",
                "Tell me about the popular food in Puducherry.",
                "Can you recommend some traditional Puducherry cuisine?"
            ],
            "responses": [
                "Absolutely! Puducherry offers a delightful blend of Indian and French cuisine. Some iconic dishes include Fish Curry, Kadugu Yerra (mustard prawns), Prawn Risotto, Crepes (both sweet and savory varieties), and Croissants. These are just a few examples of the delicious cuisine you can savor in Puducherry, reflecting its unique cultural heritage and culinary influences."
            ],
            "context": [""]
        },
        
        {
            "tag": "Rooms_To_Stay_With_Prices_Puducherry",
            "patterns": [
                "Can you tell me about rooms to stay and their prices in Puducherry?",
                "What are the accommodation options and prices in Puducherry?",
                "I'm looking for rooms to stay in Puducherry. What are the rates?",
                "What are the prices of rooms available in Puducherry?",
                "How much do rooms cost per night in Puducherry?",
                "What are the rates for different types of rooms in Puducherry?"
            ],
            "responses": [
                "Here are some accommodation options with approximate prices in Puducherry: Budget Room: Starting from ₹2000 per night, Standard Room: Starting from ₹4000 per night, Deluxe Room: Starting from ₹6000 per night, Suite: Starting from ₹10000 per night"
            ],
            "context": [""]
        },
        {
            "tag": "Transportation_Options_Puducherry",
            "patterns": [
                "What are the transportation options available in Puducherry?",
                "How can I travel around Puducherry?",
                "Can you tell me about different modes of transportation in Puducherry?"
            ],
            "responses": [
                "You can explore Puducherry using various transportation options:\n\nAuto-rickshaws: Ideal for short trips within the city, but fares may vary.\nPrivate Taxis: Available for city travel and exploring tourist attractions. Price range: ₹800 - ₹2000 per day.\nBicycle Rentals: Available for rent, ideal for exploring the city's narrow streets and promenades. Price range: ₹100 - ₹300 per day.\nScooter/Motorbike Rentals: Popular option for tourists to explore the city at their own pace. Price range: ₹300 - ₹700 per day.\nBuses: Local buses operate within Puducherry and to nearby towns. Price range: ₹10 - ₹50 per ticket."
            ],
            "context": [""]
        },
        
        {
            "tag": "Andhra Pradesh_famous_places",
            "patterns": ["Tell me about famous places in Andhra Pradesh", "What are the must-visit places in Andhra Pradesh", "Can you recommend some tourist spots in Andhra Pradesh"],
            "responses": [
                "Andhra Pradesh, known for its rich cultural heritage and historical significance, boasts several famous tourist attractions. Some of the must-visit places in Andhra Pradesh include:,**Tirupati Balaji Temple**: A renowned pilgrimage site dedicated to Lord Venkateswara, located in the town of Tirupati, **Amaravati**: The capital city of Andhra Pradesh, known for its Buddhist heritage and the Amaravati Stupa, **Araku Valley**: A picturesque hill station famous for its lush greenery, coffee plantations, and tribal culture,**Visakhapatnam (Vizag)**: A coastal city known for its pristine beaches like RK Beach, Rushikonda Beach, and the Submarine Museu, **Sri Venkateswara National Park**: A biodiversity hotspot with a variety of flora and fauna, located near Tirupati,**Borra Caves**: Natural limestone caves situated in the Ananthagiri Hills, known for their unique formations and stalactites, **Kailasagiri**: A hilltop park offering panoramic views of the city of Visakhapatnam and the Bay of Bengal,**Papikondalu**: A scenic river gorge formed by the Godavari River, offering breathtaking views and boat cruises, **Belum Caves**: The largest and longest cave system in India, known for its stalactite and stalagmite formations,**Undavalli Caves**: Ancient rock-cut caves and monolithic sculptures located near Vijayawada, dating back to the 4th-5th century CE."
            ],
            "context": [""]
        },
        {
            "tag": "Arunachal Pradesh_famous_places",
            "patterns": ["Tell me about famous places in Arunachal Pradesh", "What are the must-visit places in Arunachal Pradesh", "Can you recommend some tourist spots in Arunachal Pradesh"],
            "responses": [
                "Arunachal Pradesh, known as the 'Land of the Dawn-Lit Mountains', is blessed with natural beauty and cultural diversity. Some of the must-visit places in Arunachal Pradesh include,**Tawang Monastery**: The largest monastery in India and a revered Buddhist pilgrimage site, located in the town of Tawang,**Ziro Valley**: Known for its picturesque landscapes, rice fields, and the unique Apatani tribe, **Sela Pass**: A high-altitude mountain pass offering breathtaking views of snow-capped peaks and crystal-clear lakes, **Namdapha National Park**: One of the largest protected areas in the Eastern Himalayas, home to diverse wildlife including tigers, snow leopards, and clouded leopards,**Bomdila Monastery**: A Buddhist monastery located in Bomdila, offering panoramic views of the surrounding mountains, **Pangsau Pass**: A historic mountain pass on the India-Myanmar border, known for its scenic beauty and cultural significance, **Bhalukpong**: A picturesque town on the border of Assam and Arunachal Pradesh, known for its natural beauty and adventure sports, **Sangti Valley**: Famous for its apple orchards, natural beauty, and opportunities for birdwatching,**Eagle's Nest Wildlife Sanctuary**: A biodiversity hotspot known for its rich avifauna and stunning landscapes,**Gorichen Peak**: The highest peak in Arunachal Pradesh, popular among trekkers and adventure enthusiasts."
            ],
            "context": [""]
        },
        {
            "tag": "Assam_famous_places",
            "patterns": ["Tell me about famous places in Assam", "What are the top tourist attractions in Assam", "Can you recommend some places to visit in Assam"],
            "responses": [
                "Assam, known for its tea gardens, wildlife, and cultural heritage, is home to several famous places worth visiting. Here are some of them, **Kaziranga National Park**: Famous for its population of Indian one-horned rhinoceroses, as well as tigers, elephants, and various bird species,**Manas National Park**: A UNESCO World Heritage Site and a tiger reserve, known for its rich biodiversity and scenic beauty, **Kamakhya Temple**: A renowned Hindu temple dedicated to the goddess Kamakhya, located on the Nilachal Hill in Guwahati, **Majuli**: The world's largest river island on the Brahmaputra River, known for its Vaishnavite monasteries (Satras) and vibrant culture, **Sivasagar**: A historic town known for its Ahom architecture, including the Sivasagar Tank, Rang Ghar, and Kareng Ghar, **Tea Gardens of Assam**: Explore the lush tea estates of Assam, where some of the finest teas in the world are produced, **Umananda Island**: A river island in the Brahmaputra River, famous for the Umananda Temple dedicated to Lord Shiva, **Hajo**: A pilgrimage center known for its ancient temples, including the Hayagriva Madhava Temple, Powa Mecca, and Kedareswara Temple, **Dibru-Saikhowa National Park**: A biodiversity hotspot known for its semi-evergreen forests, grasslands, and riverine habitats, **Jorhat**: Known as the cultural capital of Assam, Jorhat is famous for its heritage sites, including the Gibbon Wildlife Sanctuary and historical monuments."
            ],
            "context": [""]
        },
        {
            "tag": "Bihar_famous_places",
            "patterns": ["Tell me about famous places in Bihar", "What are the top tourist attractions in Bihar", "Can you recommend some places to visit in Bihar"],
            "responses": [
                "Bihar, with its rich historical and cultural heritage, boasts several famous places that attract tourists from all over the world. Here are some of them, **Bodh Gaya**: A UNESCO World Heritage Site and one of the most sacred pilgrimage sites for Buddhists, where Gautama Buddha is said to have attained enlightenment, **Nalanda University**: An ancient center of learning and one of the world's earliest residential universities, known for its contributions to Buddhist studies and philosophy,**Mahabodhi Temple**: A sacred Buddhist temple built at the site of Buddha's enlightenment in Bodh Gaya, featuring a large central tower and intricately carved sculptures, **Sonepur Cattle Fair**: Asia's largest cattle fair held annually in Sonepur, attracting traders and visitors from across India for the buying and selling of livestock, **Vaishali**: An ancient city and one of the earliest republics in the world, known for its association with Lord Buddha and the Second Buddhist Council, **Patna Sahib Gurudwara**: A sacred Sikh pilgrimage site in Patna, believed to be the birthplace of Guru Gobind Singh Ji, the tenth Sikh Guru, **Rajgir**: An important religious and historical site, known for its hot springs, ancient ruins, and the Vishwa Shanti Stupa (Peace Pagoda),**Pawapuri**: A Jain pilgrimage site where Lord Mahavira, the 24th Tirthankara, attained Nirvana (liberation) and was cremated, **Vikramshila University**: A renowned ancient Buddhist university and learning center, established by King Dharmapala in the 8th century CE,**Golghar**: An iconic granary built by the British in Patna, offering panoramic views of the cityscape and the Ganges River."
            ],
            "context": [""]
        },
        {
            "tag": "Chhattisgarh_famous_places",
            "patterns": ["Tell me about famous places in Chhattisgarh", "What are the top tourist attractions in Chhattisgarh", "Can you recommend some places to visit in Chhattisgarh"],
            "responses": [
                "Chhattisgarh, known for its natural beauty and tribal culture, is home to several remarkable tourist attractions. Here are some famous places to explore,**Chitrakote Falls**: Often referred to as the 'Niagara Falls of India,' Chitrakote is the widest waterfall in India, located on the Indravati River amidst lush greenery,**Bhoramdeo Temple**: Dubbed as the 'Khajuraho of Chhattisgarh,' this ancient temple complex is renowned for its intricate carvings and sculptures, dedicated to Lord Shiva,**Tirathgarh Falls**: A picturesque waterfall located amidst dense forests in the Bastar district, offering a serene and tranquil environment for visitors,**Bastar Palace**: Also known as Jagdalpur Palace, this historical edifice reflects the architectural grandeur of the Bastar region and serves as a symbol of its rich heritage,**Sirpur**: An ancient town with archaeological significance, Sirpur boasts numerous temples, monasteries, and historical ruins dating back to the Mauryan and Gupta periods,**Kanger Valley National Park**: A biodiversity hotspot and biosphere reserve, Kanger Valley is home to diverse flora and fauna, scenic landscapes, and limestone caves,**Gangrel Dam**: Situated on the Mahanadi River, Gangrel Dam offers breathtaking views, boating opportunities, and serves as a popular picnic spot for tourists,**Danteshwari Temple**: Located in Dantewada, this temple dedicated to Goddess Danteshwari is one of the 52 Shakti Peethas and holds immense religious significance,**Ratanpur Fort**: An ancient fortification in Bilaspur district, Ratanpur Fort is known for its historical relevance and architectural splendor, attracting history enthusiasts,**Kawardha Palace**: Also known as Kawardha Raj Mahal, this royal palace-turned-heritage hotel offers a glimpse into the regal lifestyle of the erstwhile rulers of Kawardha."
            ],
            "context": [""]
        },
        {
            "tag": "Goa_famous_places",
            "patterns": ["Tell me about famous places in Goa", "What are the top tourist attractions in Goa", "Can you recommend some places to visit in Goa"],
            "responses": [
                "Goa, known for its stunning beaches and vibrant culture, offers a plethora of tourist attractions. Here are some famous places to explore,**Baga Beach**: One of the most popular beaches in Goa, known for its lively atmosphere, water sports, and beach shacks offering delicious seafood,**Calangute Beach**: Often referred to as the 'Queen of Beaches,' Calangute is renowned for its golden sands, water activities, and beachside eateries,**Old Goa**: A UNESCO World Heritage Site, Old Goa is home to historic churches such as Basilica of Bom Jesus, Se Cathedral, and Church of St. Francis of Assisi,**Fort Aguada**: A 17th-century Portuguese fort overlooking the Arabian Sea, offering panoramic views, a lighthouse, and a glimpse into Goa's colonial past,**Dudhsagar Waterfalls**: Located in the Mollem National Park, Dudhsagar Falls is one of India's tallest waterfalls, surrounded by lush greenery and scenic beauty,**Anjuna Flea Market**: A bustling market held every Wednesday, offering a wide range of goods including clothing, jewelry, handicrafts, and souvenirs,**Chapora Fort**: Perched atop a hill overlooking Vagator Beach, Chapora Fort offers stunning sunset views and a tranquil ambiance for visitors,**Basilica of Bom Jesus**: A UNESCO World Heritage Site and one of Goa's most revered churches, housing the mortal remains of St. Francis Xavier,**Aguada Jail**: Also known as the 'Central Jail,' Aguada Jail is a colonial-era prison with a rich history and panoramic views of the Arabian Sea,**Candolim Beach**: A serene and less crowded beach in North Goa, known for its peaceful ambiance, water sports, and beachside cafes."
            ],
            "context": [""]
        },
        {
            "tag": "Gujarat_famous_places",
            "patterns": ["Tell me about famous places in Gujarat", "What are the top tourist attractions in Gujarat", "Can you recommend some places to visit in Gujarat"],
            "responses": [
                "Gujarat, known for its rich heritage, vibrant culture, and architectural marvels, boasts several renowned tourist attractions. Here are some famous places to explore,**Gir National Park**: Home to the majestic Asiatic lions, Gir National Park is one of the largest protected areas for wildlife in India, offering safaris and nature trails,**Somnath Temple**: A sacred pilgrimage site and one of the 12 Jyotirlingas dedicated to Lord Shiva, located on the coast of the Arabian Sea in Veraval,**Rann of Kutch**: A vast salt marsh in the Thar Desert, famous for its white desert landscapes, cultural festivals like Rann Utsav, and unique wildlife,**Sabarmati Ashram**: Founded by Mahatma Gandhi on the banks of the Sabarmati River in Ahmedabad, this ashram served as the epicenter of India's freedom struggle,**Statue of Unity**: The world's tallest statue, dedicated to Sardar Vallabhbhai Patel, located near the Sardar Sarovar Dam in the Narmada district,**Dwarkadhish Temple**: A major Hindu pilgrimage site dedicated to Lord Krishna, located in Dwarka on the coast of the Arabian Sea, one of the Char Dham sites,**Laxmi Vilas Palace**: An opulent royal residence in Vadodara, designed in Indo-Saracenic style, boasting grand architecture, lush gardens, and a museum,**Adalaj Stepwell**: A stunning stepwell near Ahmedabad, known for its intricate carvings, architectural brilliance, and historical significance,**Gandhi Ashram**: Also known as the Sabarmati Ashram, this historic site served as Mahatma Gandhi's residence and is now a museum preserving his legacy,**Modhera Sun Temple**: An ancient Hindu temple dedicated to the Sun God, renowned for its exquisite architecture, intricate carvings, and annual Modhera Dance Festival."
            ],
            "context": [""]
        },
        {
            "tag": "Haryana_famous_places",
            "patterns": ["Tell me about famous places in Haryana", "What are the top tourist attractions in Haryana", "Can you recommend some places to visit in Haryana"],
            "responses": [
                "Haryana, known for its historical sites, cultural heritage, and modern attractions, offers several noteworthy tourist spots. Here are some famous places to explore,**Sultanpur National Park**: A renowned bird sanctuary near Gurugram, attracting migratory birds and offering birdwatching opportunities amidst serene surroundings,**Surajkund**: Famous for its annual Surajkund Crafts Mela, showcasing traditional crafts, art, and cuisine from different states of India, held in Faridabad,**Kurukshetra**: A sacred pilgrimage site and historical city associated with the Mahabharata, featuring temples, museums, and the Brahma Sarovar,**Pinjore Gardens**: Also known as Yadavindra Gardens, these Mughal-style gardens in Pinjore boast lush greenery, cascading fountains, and architectural beauty,**Rock Garden of Chandigarh**: A unique sculpture garden created from industrial and urban waste materials, displaying artwork, sculptures, and waterfalls,**Bhima Devi Temple**: An ancient temple dedicated to Goddess Bhima Devi, showcasing intricate sculptures and relics from the Buddhist and Gupta periods,**Sohna Hills**: A picturesque hill station near Gurugram, offering panoramic views, hot springs, adventure activities like ziplining, and nature trails,**Morni Hills**: A scenic hill station in the Panchkula district, known for its verdant landscapes, lakes, and trekking trails amidst the Shivalik Range,**Sheetla Mata Temple**: A revered Hindu temple dedicated to Mata Sheetla Devi, known for its annual Sheetla Mata Fair and religious significance,**Gurgaon Heritage Museum**: A museum showcasing the history, culture, and heritage of Gurgaon through artifacts, photographs, and exhibits."
            ],
            "context": [""]
        },
        {
            "tag": "Himachal_Pradesh_famous_places",
            "patterns": ["Tell me about famous places in Himachal Pradesh", "What are the top tourist attractions in Himachal Pradesh", "Can you recommend some places to visit in Himachal Pradesh"],
            "responses": [
                "Himachal Pradesh, known for its stunning landscapes, snow-capped mountains, and serene valleys, offers a plethora of famous tourist attractions. Here are some must-visit places,**Shimla**: The capital city known for its colonial architecture, Mall Road, and scenic beauty, offering attractions like the Ridge, Jakhu Temple, and Christ Church, **Manali**: A popular hill station nestled in the Himalayas, famous for adventure activities like skiing, paragliding, and trekking, as well as attractions like Hadimba Temple and Solang Valley,**Dharamshala**: Known as the residence of the Dalai Lama, Dharamshala offers Tibetan culture, monasteries, and breathtaking views of the Dhauladhar Range, along with attractions like McLeod Ganj and Bhagsu Nag Temple,**Dalhousie**: A charming hill station with colonial architecture, lush greenery, and panoramic views of the Himalayas, featuring attractions like Khajjiar, Dainkund Peak, and Kalatop Wildlife Sanctuary,**Kullu**: Renowned for its scenic beauty, adventure sports, and vibrant culture, Kullu offers attractions like Great Himalayan National Park, Raghunath Temple, and Bijli Mahadev Temple,**Kasol**: A picturesque village nestled along the Parvati River, known for its hippie culture, trekking trails, and serene atmosphere amidst pine forests and mountains,**Chamba**: A heritage town known for its ancient temples, palaces, and scenic beauty, offering attractions like Chamba Palace, Lakshmi Narayan Temple, and Bhuri Singh Museum,**Spiti Valley**: A high-altitude desert valley offering surreal landscapes, Buddhist monasteries, and adventure opportunities like trekking, camping, and exploring ancient culture and traditions,**Kinnaur**: A remote district known for its apple orchards, traditional villages, and stunning vistas of snow-capped peaks, with attractions like Kalpa, Sangla Valley, and Nako Lake,**Palampur**: A serene town known for its tea gardens, colonial architecture, and scenic beauty, offering attractions like Andretta Pottery, Neugal Khad, and Tashi Jong Monastery."
            ],
            "context": [""]
        },
        {
            "tag": "Jharkhand_famous_places",
            "patterns": ["Tell me about famous places in Jharkhand", "What are the top tourist attractions in Jharkhand", "Can you recommend some places to visit in Jharkhand"],
            "responses": [
                "Jharkhand, known for its rich cultural heritage, tribal communities, and natural beauty, boasts several famous tourist attractions. Here are some notable places to explore,**Ranchi**: The capital city known for its scenic beauty, waterfalls, and temples, offering attractions like Hundru Falls, Tagore Hill, and Rock Garden,**Netarhat**: Also known as the 'Queen of Chotanagpur', Netarhat is a scenic hill station known for its lush forests, sunrise and sunset points, and panoramic views of the Patkai Range,**Hazaribagh**: A picturesque town known for its wildlife sanctuary, lakes, and hills, offering attractions like Hazaribagh National Park, Canary Hill, and Rajrappa Temple,**Deoghar**: A sacred pilgrimage site known for the Baidyanath Temple, one of the twelve Jyotirlingas, along with attractions like Nandan Pahar, Tapovan, and Trikuta Parvata,**Jamshedpur**: A planned industrial city known for its steel industry, parks, and educational institutions, offering attractions like Jubilee Park, Tata Steel Zoological Park, and Dalma Wildlife Sanctuary,**Dhanbad**: Known as the 'Coal Capital of India', Dhanbad is an important mining town with attractions like Maithon Dam, Panchet Dam, and Topchanchi Lake,**Giridih**: A scenic town known for its hills, waterfalls, and trekking trails, offering attractions like Usri Falls, Parasnath Hill, and Khandoli Dam,**Betla National Park**: One of the oldest national parks in India, Betla National Park is known for its diverse flora and fauna, wildlife safaris, and ancient ruins of Palamu Fort,**McCluskieganj**: A quaint Anglo-Indian settlement known for its colonial bungalows, churches, and serene surroundings, offering a glimpse into its unique cultural heritage,**Palamu**: A region known for its wildlife, forests, and historical significance, with attractions like Palamu Tiger Reserve, Betla Fort, and Upper Ghaghri Waterfall."
            ],
            "context": [""]
        },
        {
            "tag": "Karnataka_famous_places",
            "patterns": ["Tell me about famous places in Karnataka", "What are the top tourist attractions in Karnataka", "Can you recommend some places to visit in Karnataka"],
            "responses": [
                "Karnataka, known for its rich history, diverse culture, and natural beauty, boasts several famous tourist attractions. Here are some notable places to explore,**Bangalore (Bengaluru)**: The capital city known as the 'Silicon Valley of India', offering attractions like Lalbagh Botanical Garden, Cubbon Park, Bangalore Palace, and innovative tech parks,**Mysore (Mysuru)**: Known for its royal heritage and cultural richness, offering attractions like Mysore Palace, Chamundi Hill, Brindavan Gardens, and St. Philomena's Church,**Coorg (Kodagu)**: A scenic hill station known for its coffee plantations, misty hills, and wildlife sanctuaries, offering attractions like Abbey Falls, Raja's Seat, Dubare Elephant Camp, and Talakaveri,**Hampi**: A UNESCO World Heritage Site known for its ancient ruins, temples, and architectural marvels from the Vijayanagara Empire, offering attractions like Virupaksha Temple, Hampi Bazaar, Vittala Temple, and Lotus Palace,**Gokarna**: A serene coastal town known for its pristine beaches, temples, and laid-back vibe, offering attractions like Om Beach, Kudle Beach, Half Moon Beach, and Mahabaleshwar Temple,**Badami**: An archaeological site known for its cave temples, rock-cut architecture, and ancient sculptures, offering attractions like Badami Cave Temples, Agastya Lake, Banashankari Temple, and Bhutanatha Temples,**Bandipur National Park**: A renowned tiger reserve and biodiversity hotspot, offering wildlife safaris, birdwatching, and nature trails amidst lush forests and grasslands,**Belur and Halebidu**: Historic towns known for their exquisite Hoysala architecture, temples, and intricate stone carvings, offering attractions like Chennakesava Temple, Hoysaleswara Temple, and Kedareshwara Temple,**Udupi**: A pilgrimage center known for its temples, cuisine, and cultural heritage, offering attractions like Udupi Sri Krishna Temple, St. Mary's Island, Malpe Beach, and Manipal University,**Chikmagalur**: A popular hill station known for its coffee estates, trekking trails, and scenic beauty, offering attractions like Mullayanagiri Peak, Baba Budangiri, Kemmangundi, and Bhadra Wildlife Sanctuary."
            ],
            "context": [""]
        },
        {
            "tag": "Kerala_famous_places",
            "patterns": ["Tell me about famous places in Kerala", "What are the top tourist attractions in Kerala", "Can you recommend some places to visit in Kerala"],
            "responses": [
                "Kerala, often referred to as 'God's Own Country', is renowned for its backwaters, hill stations, and cultural heritage. Here are some famous places to explore,**Alleppey (Alappuzha)**: Known for its mesmerizing backwaters, houseboat cruises, and serene landscapes, offering attractions like Alleppey Beach, Kumarakom Bird Sanctuary, and Vembanad Lake,**Munnar**: A picturesque hill station known for its tea gardens, misty hills, and biodiversity, offering attractions like Eravikulam National Park, Mattupetty Dam, Tea Museum, and Anamudi Peak,**Kovalam**: A popular beach destination known for its golden sands, clear waters, and Ayurvedic resorts, offering attractions like Lighthouse Beach, Hawa Beach, Samudra Beach, and Vizhinjam Rock Cut Cave Temple,**Thekkady (Periyar)**: Famous for Periyar Wildlife Sanctuary, offering wildlife safaris, boat cruises, and trekking trails amidst dense forests, and Periyar Lake,**Kochi (Cochin)**: A historic port city known for its blend of cultures, colonial architecture, and vibrant markets, offering attractions like Fort Kochi, Mattancherry Palace, Chinese Fishing Nets, and Kerala Kathakali Centre,**Wayanad**: A scenic district known for its lush greenery, waterfalls, and wildlife sanctuaries, offering attractions like Banasura Sagar Dam, Edakkal Caves, Soochipara Falls, and Wayanad Wildlife Sanctuary,**Varkala**: A coastal town known for its cliffs, beaches, and religious significance, offering attractions like Varkala Beach, Sivagiri Mutt, Janardanaswamy Temple, and Kappil Lake,**Kumarakom**: Famous for its backwaters and bird sanctuaries, offering attractions like Kumarakom Bird Sanctuary, Vembanad Lake, Pathiramanal Island, and Aruvikkuzhi Waterfall,**Thrissur**: Known as the cultural capital of Kerala, offering attractions like Vadakkunnathan Temple, Thrissur Pooram, Athirappilly Falls, and Kerala Kalamandalam,**Poovar**: A tranquil backwater destination near Thiruvananthapuram, offering attractions like Poovar Beach, Poovar Backwaters, Golden Sand Beach, and Neyyar Wildlife Sanctuary."
            ],
            "context": [""]
        },
        {
            "tag": "Madhya_Pradesh_famous_places",
            "patterns": ["Tell me about famous places in Madhya Pradesh", "What are the top tourist attractions in Madhya Pradesh", "Can you recommend some places to visit in Madhya Pradesh"],
            "responses": [
                "Madhya Pradesh, often called the 'Heart of India', is known for its rich history, architectural marvels, and diverse landscapes. Here are some famous places to explore,**Khajuraho Group of Monuments**: UNESCO World Heritage Site known for its exquisite temples with intricate carvings depicting various aspects of life, love, and spirituality,**Sanchi Stupa**: UNESCO World Heritage Site and one of the oldest stone structures in India, known for its Great Stupa, monasteries, and intricately carved gateways,**Bandhavgarh National Park**: Famous for its high density of tigers and diverse wildlife, offering wildlife safaris, birdwatching, and nature trails,**Gwalior Fort**: A majestic hill fort known for its imposing architecture, palaces, temples, and the iconic Man Singh Palace,**Kanha National Park**: One of the largest and most well-maintained national parks in India, renowned for its tiger population, lush forests, and diverse flora and fauna,**Bhimbetka Rock Shelters**: UNESCO World Heritage Site known for its prehistoric cave paintings dating back to the Paleolithic era, providing insights into early human life,**Orchha**: A medieval town known for its grand palaces, temples, and cenotaphs, offering attractions like Orchha Fort, Raja Mahal, Jahangir Mahal, and Chaturbhuj Temple,**Pachmarhi**: A hill station nestled amidst the Satpura Range, known for its scenic beauty, waterfalls, caves, and rich biodiversity,**Ujjain**: A sacred city on the banks of the Shipra River, known for its temples, ghats, and religious festivals like the Kumbh Mela and Mahakaleshwar Jyotirlinga Temple,**Jabalpur**: Known for its natural attractions like Dhuandhar Falls, Marble Rocks, and Bhedaghat, offering boat rides amidst stunning natural landscapes."
            ],
            "context": [""]
        },

        {
            "tag": "Maharashtra_famous_places",
            "patterns": ["Tell me about famous places in Maharashtra", "What are the top tourist attractions in Maharashtra", "Can you recommend some places to visit in Maharashtra"],
            "responses": [
                "Maharashtra, known for its vibrant culture, historical landmarks, and scenic beauty, offers a plethora of famous attractions. Here are some must-visit places,**Mumbai**: The bustling capital city known for its iconic landmarks like Gateway of India, Marine Drive, Bollywood studios, and vibrant street life,**Ajanta and Ellora Caves**: UNESCO World Heritage Sites renowned for their ancient rock-cut caves with exquisite sculptures and paintings depicting Buddhist and Hindu art,**Lonavala and Khandala**: Picturesque hill stations famous for their lush greenery, scenic viewpoints, waterfalls, and adventure activities like trekking and rappelling,**Pune**: A vibrant city known for its rich history, educational institutions, and cultural heritage, offering attractions like Aga Khan Palace, Shaniwar Wada, and Osho Ashram,**Nashik**: Known for its religious significance, especially during the Kumbh Mela, and attractions like Trimbakeshwar Temple, Sula Vineyards, and Pandavleni Caves,**Aurangabad**: Home to UNESCO-listed Ajanta and Ellora Caves, Bibi Ka Maqbara, and other historical sites showcasing the region's Mughal and Maratha heritage,**Mahabaleshwar**: A popular hill station known for its lush green valleys, strawberry farms, viewpoints like Arthur's Seat and Wilson Point, and serene lakes,**Lavasa**: India's first planned hill city known for its picturesque setting, lakeside promenade, adventure sports, and modern infrastructure,**Alibaug**: A coastal town known for its sandy beaches, historic forts like Kolaba Fort, water sports, and seafood delicacies,**Panchgani**: Another scenic hill station known for its strawberry farms, Table Land plateau, Parsi Point, and panoramic views of the surrounding hills."
            ],
            "context": [""]
        },
        {
            "tag": "Manipur_famous_places",
            "patterns": ["Tell me about famous places in Manipur", "What are the top tourist attractions in Manipur", "Can you recommend some places to visit in Manipur"],
            "responses": [
                "Manipur, known as the 'Jewel of India' for its scenic beauty and rich cultural heritage, offers several captivating tourist attractions. Here are some famous places to explore,**Loktak Lake**: The largest freshwater lake in Northeast India, known for its floating phumdis (heterogeneous mass of vegetation, soil, and organic matter) and the Keibul Lamjao National Park, home to the endangered Sangai deer,**Kangla Fort**: A historic fort complex in Imphal, once the seat of the Manipuri kings, featuring ancient temples, artifacts, and relics of historical significance,**Ima Keithel (Mother's Market)**: Asia's largest all-women market in Imphal, where local women vendors sell a wide range of traditional Manipuri handicrafts, textiles, and local produce,**Shri Govindajee Temple**: A prominent Hindu temple dedicated to Lord Krishna in Imphal, known for its architectural beauty, religious festivals, and cultural performances,**Manipur State Museum**: A museum in Imphal showcasing the rich cultural heritage of Manipur through its collection of artifacts, manuscripts, traditional costumes, and archaeological finds,**Thalon Cave**: A natural limestone cave system in Ukhrul district, offering spelunking (cave exploration) opportunities and a chance to marvel at unique rock formations and underground streamsm**Khongjom War Memorial**: A historical site near Imphal commemorating the Battle of Khongjom, a significant event in Manipur's history, with a war memorial, museum, and panoramic views of the surrounding landscape,**Dzuko Valley**: A picturesque valley located on the border of Manipur and Nagaland, known for its seasonal Dzukou lilies, pristine landscapes, and trekking trails amidst rolling hills,**Andro Village**: A traditional Manipuri village near Imphal, known for its cultural heritage, ancient rituals, and craft traditions like pottery making, bamboo crafts, and handloom weaving,**Keibul Lamjao National Park**: The world's only floating national park located in Bishnupur district, famous for its unique ecosystem, wetland biodiversity, and conservation efforts for the Sangai deer."
            ],
            "context": [""]
        },
        {
            "tag": "Meghalaya_famous_places",
            "patterns": ["Tell me about famous places in Meghalaya", "What are the top tourist attractions in Meghalaya", "Can you recommend some places to visit in Meghalaya"],
            "responses": [
                "Meghalaya, known as the 'Abode of Clouds', is blessed with breathtaking natural beauty and picturesque landscapes. Here are some famous places to explore,**Cherrapunji (Sohra)**: Known as one of the wettest places on Earth, Cherrapunji offers stunning vistas of lush green valleys, cascading waterfalls like Nohkalikai Falls, and living root bridges in villages like Mawlynnong and Riwai,**Shillong**: The capital city of Meghalaya, often referred to as the 'Scotland of the East', is famous for its pleasant climate, colonial architecture, scenic lakes like Umiam Lake, and cultural attractions like Don Bosco Museum and Shillong Peak,**Mawsynram**: Another contender for the title of the wettest place on Earth, Mawsynram offers mesmerizing landscapes, caves like Mawjymbuin Cave, and the unique Krem Puri cave system for adventurous explorers,**Dawki**: Known for its crystal-clear Umngot River, Dawki offers boating and breathtaking views of the surrounding hills and forests, with the Indo-Bangladesh border nearby,**Double Decker Living Root Bridge (Nongriat)**: A marvel of indigenous engineering, this living root bridge near the village of Nongriat is a UNESCO World Heritage site and a popular trekking destination,**Mawphlang Sacred Forest**: A sacred grove near Shillong revered by the Khasi tribes, offering a glimpse into Meghalaya's rich biodiversity, with ancient trees, medicinal plants, and unique flora and fauna,**Siju Cave**: One of the longest caves in India, located in the Garo Hills region, offering spelunking adventures and the chance to witness impressive stalactites, stalagmites, and underground rivers,**Balpakram National Park**: Known for its rugged landscapes, deep gorges, and diverse wildlife including the rare red panda and clouded leopard, Balpakram National Park is a haven for nature enthusiasts and wildlife photographers,**Nohkalikai Falls**: Located near Cherrapunji, Nohkalikai Falls is one of the tallest plunge waterfalls in India, cascading down a verdant cliff amidst misty clouds and lush greenery,**Elephant Falls**: A popular tourist spot near Shillong, Elephant Falls is named after a rock resembling an elephant and offers picturesque views, especially during the monsoon season when the waterfall is at its full glory."
            ],
            "context": [""]
        },
        {
            "tag": "Mizoram_famous_places",
            "patterns": ["Tell me about famous places in Mizoram", "What are the top tourist attractions in Mizoram", "Can you recommend some places to visit in Mizoram"],
            "responses": [
                "Mizoram, known for its lush greenery, rolling hills, and rich tribal culture, offers several captivating tourist attractions. Here are some famous places to explore,**Aizawl**: The capital city of Mizoram, nestled amidst scenic hills, offers panoramic views, vibrant markets, and cultural attractions like the Mizoram State Museum, Durtlang Hills, and Solomon's Temple,**Reiek**: A picturesque hill station near Aizawl, known for its breathtaking views of the surrounding valleys and mountains, trekking trails, and the traditional Mizo village showcasing local culture and heritage,**Champhai**: Located near the Myanmar border, Champhai offers stunning landscapes, panoramic views of the Blue Mountain Range, and attractions like Rih Dil Lake, Murlen National Park, and the scenic Mura Puk caves,**Phawngpui (Blue Mountain)**: The highest peak in Mizoram, also known as 'The abode of gods', offers trekking opportunities, rich biodiversity, and panoramic views of the surrounding valleys, forests, and waterfalls,**Vantawng Falls**: One of the highest waterfalls in Mizoram, Vantawng Falls cascades down from a height amidst lush greenery, offering a mesmerizing sight for nature lovers and photographers,**Serchhip**: Known for its serene landscapes, Serchhip offers attractions like the Tawi Wildlife Sanctuary, the Khawnglung Wildlife Sanctuary, and the picturesque Chhingpui picnic spot,**Tam Dil**: A scenic lake located near Saitual town, surrounded by lush green hills and dense forests, offering boating, picnicking, and camping opportunities amidst serene surroundings,**Dampa Tiger Reserve**: A biodiversity hotspot and a designated Tiger Reserve, Dampa offers opportunities for wildlife safaris, birdwatching, and trekking amidst dense forests, waterfalls, and natural habitats,**Palak Lake**: Also known as Pala Tipo, Palak Lake is a natural freshwater lake surrounded by verdant forests and hills, offering boating, fishing, and birdwatching experiences amidst tranquil surroundings,**Lunglei**: The second-largest town in Mizoram, Lunglei offers attractions like the Zobawk Sports Academy, Saikuti Hall, Khawnglung Wildlife Sanctuary, and panoramic views from the Lunglei Bridge."
            ],
            "context": [""]
        },
        {
            "tag": "Nagaland_famous_places",
            "patterns": ["Tell me about famous places in Nagaland", "What are the top tourist attractions in Nagaland", "Can you recommend some places to visit in Nagaland"],
            "responses": [
                "Nagaland, known for its vibrant tribal culture, scenic landscapes, and traditional festivals, offers several captivating tourist attractions. Here are some famous places to explore,**Kohima**: The capital city of Nagaland, Kohima is known for its rich history, World War II cemetery, and cultural heritage. Key attractions include the Kohima War Cemetery, Naga Heritage Village, and the State Museum,**Dimapur**: The largest city in Nagaland, Dimapur offers attractions like the ruins of Kachari Kingdom, Triple Falls, Nagaland Zoological Park, and the atmospheric Hong Kong Market,**Mokokchung**: Known as the cultural and intellectual capital of Nagaland, Mokokchung offers insights into Naga traditions, customs, and festivals. Key attractions include Longkhum Village, Ungma Village, and the Mokokchung Town Square,**Wokha**: Famous for its scenic beauty and orange orchards, Wokha offers attractions like the Doyang River, Mount Tiyi, and the Totsu Cliff,**Tuensang**: Known for its tribal diversity and traditional villages, Tuensang offers attractions like the Changsangmongko Village, Chilise Village, and the Tsadang Village,**Dzukou Valley**: A picturesque valley known for its pristine beauty, seasonal flowers, and trekking trails, offering breathtaking views of the surrounding hills and landscapes,**Phek**: Blessed with natural beauty and cultural richness, Phek offers attractions like the Shilloi Lake, Pfutsero Village, and the Phek Town Park,**Mon**: Known for its warrior tribes and traditional festivals, Mon offers attractions like the Veda Peak, Longwa Village, and the Shangnyu Village,**Peren**: A scenic district known for its lush greenery, waterfalls, and biodiversity, Peren offers attractions like the Benreu Village, Mt. Pauna Tourist Village, and the Mimi Village,**Zunheboto**: Famous for its vibrant culture and traditional dances, Zunheboto offers attractions like the Sumi Baptist Church, Likhaba Village, and the Ghosu Bird Sanctuary."
            ],
            "context": [""]
        },
        {
            "tag": "Odisha_famous_places",
            "patterns": ["Tell me about famous places in Odisha", "What are the top tourist attractions in Odisha", "Can you recommend some places to visit in Odisha"],
            "responses": [
                "Odisha, known for its rich cultural heritage, ancient temples, and scenic beaches, offers several remarkable tourist attractions. Here are some famous places to explore,**Konark Sun Temple**: A UNESCO World Heritage Site, the Konark Sun Temple is famous for its intricate architecture and sculptural work depicting the chariot of the Sun God. It is a marvel of Odishan architecture,**Jagannath Temple, Puri**: One of the Char Dham pilgrimage sites, the Jagannath Temple in Puri is dedicated to Lord Jagannath (a form of Lord Vishnu). It is known for its annual Rath Yatra (chariot festival) and sacred atmosphere,**Bhubaneswar**: The capital city of Odisha, Bhubaneswar is known as the 'City of Temples' due to its numerous ancient temples, including the Lingaraj Temple, Mukteshwar Temple, and Rajarani Temple,**Puri Beach**: A popular beach destination, Puri Beach is known for its golden sands, vibrant atmosphere, and annual Puri Beach Festival. It offers activities like sunbathing, camel rides, and beachside shopping,**Chilika Lake**: Asia's largest brackish water lagoon, Chilika Lake is a haven for birdwatchers and nature enthusiasts. It is home to numerous migratory birds, including flamingos and pelicans,**Udayagiri and Khandagiri Caves**: These ancient rock-cut caves near Bhubaneswar date back to the 2nd century BCE and showcase Jain and Buddhist influences through their inscriptions and carvings,**Lingaraj Temple**: A revered Hindu temple dedicated to Lord Shiva, the Lingaraj Temple in Bhubaneswar is an architectural marvel known for its towering spire (vimana) and intricate carvings,**Simlipal National Park**: One of India's most pristine national parks, Simlipal is known for its diverse flora and fauna, including Bengal tigers, elephants, and orchids. It offers opportunities for wildlife safaris and nature walks,**Raghurajpur Artist Village**: A traditional crafts village near Puri, Raghurajpur is known for its Pattachitra paintings, palm leaf engravings, and Gotipua dance performances,**Hirakud Dam**: One of the longest dams in the world, Hirakud Dam on the Mahanadi River offers scenic views, boating opportunities, and a chance to witness the impressive engineering feat."
            ],
            "context": [""]
        },
        {
            "tag": "Punjab_famous_places",
            "patterns": ["Tell me about famous places in Punjab", "What are the top tourist attractions in Punjab", "Can you recommend some places to visit in Punjab"],
            "responses": [
                "Punjab, known for its rich history, vibrant culture, and delicious cuisine, boasts several iconic tourist attractions. Here are some famous places to explore,**Golden Temple (Harmandir Sahib)**: Located in Amritsar, the Golden Temple is the holiest shrine for Sikhs and one of the most spiritually uplifting places to visit. Its golden exterior and serene ambiance attract millions of visitors each year,**Jallianwala Bagh**: Adjacent to the Golden Temple in Amritsar, Jallianwala Bagh is a poignant memorial dedicated to the martyrs of the Jallianwala Bagh massacre of 1919. It serves as a reminder of India's struggle for independence,**Wagah Border**: The Wagah Border between India and Pakistan near Amritsar is famous for its ceremonial border closing ceremony, known as the 'Wagah Border Ceremony' or 'Beating Retreat Ceremony'. It is a patriotic and entertaining spectacle,**Anandpur Sahib**: An important Sikh pilgrimage site, Anandpur Sahib is known for its historic gurdwaras, including Takht Sri Keshgarh Sahib and Gurdwara Sri Anandpur Sahib. It is also the birthplace of the Khalsa Panth,**Rock Garden of Chandigarh**: Created by artist Nek Chand, the Rock Garden is a unique sculpture garden built using recycled materials such as industrial and urban waste. It features quirky sculptures, waterfalls, and winding pathways,**Sultanpur Lodhi**: A historic town in Kapurthala district, Sultanpur Lodhi is associated with Guru Nanak Dev Ji, the founder of Sikhism. It has several gurdwaras and historic sites related to Guru Nanak's life and teachings,**Sheesh Mahal, Patiala**: Located in the Qila Mubarak complex in Patiala, Sheesh Mahal (Palace of Mirrors) is a stunning example of Indo-Islamic architecture. It features intricate mirror work, frescoes, and beautiful gardens,**Ranjit Sagar Dam**: Also known as the Thein Dam, Ranjit Sagar Dam is a multipurpose dam built on the Ravi River in Pathankot district. It offers scenic views, boating opportunities, and is a popular picnic spot,**Fateh Burj**: Situated in the town of Mohali, Fateh Burj is the tallest victory tower in India. It was built to commemorate the victory of the Sikhs in the Battle of Chappar Chiri. Visitors can enjoy panoramic views from the top,**Patiala Qila (Fort)**: The Patiala Fort, also known as Qila Mubarak, is a majestic fort complex in Patiala. It houses several palaces, museums, and architectural wonders, including the Sheesh Mahal and Ran Baas."
            ],
            "context": [""]
        },
        {
            "tag": "Rajasthan_famous_places",
            "patterns": ["Tell me about famous places in Rajasthan", "What are the top tourist attractions in Rajasthan", "Can you recommend some places to visit in Rajasthan"],
            "responses": [
                "Rajasthan, known as the 'Land of Kings', is renowned for its majestic forts, opulent palaces, vibrant culture, and desert landscapes. Here are some famous places to explore,**Jaipur (Pink City)**: The capital city of Rajasthan, Jaipur is famous for its historic monuments, including the Amber Fort, City Palace, Hawa Mahal, and Jantar Mantar. It also offers vibrant markets and traditional Rajasthani cuisine,**Udaipur (City of Lakes)**: Known for its picturesque lakes, Udaipur is home to the majestic Lake Palace, City Palace, Jag Mandir, and Saheliyon ki Bari. It offers a romantic ambiance and stunning views,**Jodhpur (Blue City)**: Dominated by the imposing Mehrangarh Fort, Jodhpur is known for its blue-painted houses, bustling markets, and vibrant culture. Other attractions include Jaswant Thada and Umaid Bhawan Palace,**Jaisalmer (Golden City)**: Located in the heart of the Thar Desert, Jaisalmer is famous for its golden sandstone fort, camel safaris, and desert camping experiences. Don't miss the intricately carved havelis and the Desert Festival,**Pushkar**: A sacred pilgrimage site known for the Brahma Temple and Pushkar Lake, Pushkar attracts visitors with its spiritual ambiance, camel fair, and colorful bazaars selling traditional Rajasthani handicrafts,**Ranthambore National Park**: One of the largest national parks in India, Ranthambore is renowned for its population of Bengal tigers. Visitors can enjoy wildlife safaris, birdwatching, and exploring ancient ruins,**Ajmer**: Home to the revered Ajmer Sharif Dargah, Ajmer is a major pilgrimage destination for Muslims. Other attractions include the Adhai Din Ka Jhonpra mosque, Ana Sagar Lake, and Taragarh Fort,**Bikaner**: Known for its well-preserved medieval architecture, Bikaner is famous for Junagarh Fort, Karni Mata Temple (Rat Temple), and camel breeding farms. It offers a glimpse into the royal heritage of Rajasthan,**Chittorgarh Fort**: One of the largest forts in India, Chittorgarh Fort is a UNESCO World Heritage Site known for its historical significance and architectural splendor. It offers panoramic views of the surrounding countryside,**Mount Abu**: The only hill station in Rajasthan, Mount Abu is famous for its cool climate, scenic beauty, and Dilwara Temples. Visitors can enjoy boating on Nakki Lake and exploring the lush forests of the Aravalli Range."
            ],
            "context": [""]
        },
        {
            "tag": "Sikkim_famous_places",
            "patterns": ["Tell me about famous places in Sikkim", "What are the top tourist attractions in Sikkim", "Can you recommend some places to visit in Sikkim"],
            "responses": [
                "Sikkim, nestled in the Himalayas, is known for its breathtaking landscapes, Buddhist monasteries, and rich cultural heritage. Here are some famous places to explore,**Gangtok**: The capital city of Sikkim, Gangtok offers panoramic views of the Kanchenjunga range and is known for its Buddhist monasteries, including Rumtek Monastery and Enchey Monastery. Don't miss the scenic views from Tashi Viewpoint,**Tsomgo Lake (Changu Lake)**: A glacial lake located at an altitude of 12,310 feet, Tsomgo Lake is known for its turquoise waters and surrounding snow-capped mountains. Visitors can enjoy yak rides and local snacks,**Nathu La Pass**: A mountain pass on the Indo-China border, Nathu La offers stunning views of the Himalayas and is an important trading route between India and China. It requires a special permit to visit,**Pelling**: Situated in West Sikkim, Pelling offers breathtaking views of the Himalayas, including the Kanchenjunga peak. Key attractions include Pemayangtse Monastery, Rabdentse Ruins, and Khecheopalri Lake,**Yuksom**: Known as the 'Gateway to Kangchenjunga', Yuksom is the base for several treks in Sikkim, including the Goechala Trek and Dzongri Trek. It also features historical sites like Norbugang Park and Dubdi Monastery,**Lachung and Lachen**: Picturesque villages in North Sikkim, Lachung and Lachen serve as gateways to Yumthang Valley and Gurudongmar Lake. Visitors can enjoy snow-capped peaks, alpine meadows, and hot springs,**Ravangla**: A tranquil town in South Sikkim, Ravangla offers panoramic views of the Himalayas and is known for its serene atmosphere. Key attractions include Buddha Park, Ralong Monastery, and Rayong Sunrise Viewpoint,**Namchi**: The cultural capital of Sikkim, Namchi is known for its giant statues of Guru Padmasambhava (Guru Rinpoche) and Lord Shiva. Other attractions include Samdruptse Hill, Char Dham, and Tendong Hill,**Zuluk**: A remote village in East Sikkim, Zuluk offers stunning views of the sunrise over the Himalayas and is known for its winding roads, old silk route, and high-altitude landscapes,**Gurudongmar Lake**: Located at an altitude of 17,800 feet, Gurudongmar Lake is one of the highest lakes in the world and is considered sacred by both Buddhists and Sikhs. It offers breathtaking views of the surrounding mountains."
            ],
            "context": [""]
        },
        {
            "tag": "Tamil Nadu_famous_places",
            "patterns": ["Tell me about famous places in Tamil Nadu", "What are the top tourist attractions in Tamil Nadu", "Can you recommend some places to visit in Tamil Nadu"],
            "responses": [
                "Tamil Nadu, known for its rich cultural heritage, magnificent temples, and scenic landscapes, offers several iconic tourist attractions. Here are some famous places to explore,**Mahabalipuram (Mamallapuram)**: Famous for its UNESCO World Heritage Site, Mahabalipuram boasts ancient rock-cut temples, cave temples, and intricately carved sculptures. Don't miss the Shore Temple and Arjuna's Penance,**Chennai**: The capital city of Tamil Nadu, Chennai, is a vibrant metropolis known for its Marina Beach, historic landmarks like Fort St. George and Kapaleeshwarar Temple, and cultural events like the Chennai Music Festival,**Madurai**: Known as the 'Athens of the East', Madurai is famous for the Meenakshi Amman Temple, a sprawling complex with colorful gopurams, intricate carvings, and a sacred tank. Visit during the Meenakshi Thirukalyanam festival for a vibrant cultural experience,**Kanyakumari**: Situated at the southernmost tip of India, Kanyakumari is known for its stunning sunrise and sunset views over the confluence of the Arabian Sea, Bay of Bengal, and Indian Ocean. Visit the Vivekananda Rock Memorial and Thiruvalluvar Statue,**Ooty (Udhagamandalam)**: A popular hill station in the Nilgiri Hills, Ooty is known for its lush greenery, tea gardens, and pleasant climate. Enjoy boating in Ooty Lake, take a ride on the Nilgiri Mountain Railway, and explore the Botanical Gardens,**Thanjavur (Tanjore)**: Known for its rich history and architectural marvels, Thanjavur is famous for the Brihadeeswarar Temple, a UNESCO World Heritage Site, and the Thanjavur Palace. Don't miss the bronze sculptures at the Art Gallery,**Kodaikanal**: Nestled in the Palani Hills, Kodaikanal is known for its scenic beauty, serene lakes, and misty landscapes. Visit Coaker's Walk, Bryant Park, Pillar Rocks, and the serene Kodaikanal Lake for a relaxing getaway,**Rameswaram**: A sacred pilgrimage site for Hindus, Rameswaram is known for its Ramanathaswamy Temple, a major pilgrimage destination, and the Pamban Bridge, India's first sea bridge. Take a dip in the sacred waters of Agni Theertham,**Coimbatore**: Known as the 'Manchester of South India', Coimbatore is an industrial city surrounded by the Western Ghats. Explore the ancient temples of Marudamalai and Perur, and enjoy the tranquil atmosphere of the Vydehi Falls,**Kanchipuram**: Renowned for its silk sarees and ancient temples, Kanchipuram is one of the seven Moksha-puris in Hinduism. Visit the Kanchi Kailasanathar Temple, Ekambareswarar Temple, and the Kanchipuram Silk Weaving Center,**Tiruchirappalli (Trichy)**: Home to the iconic Rockfort Temple, Tiruchirappalli is known for its religious significance, bustling bazaars, and traditional cuisine. Climb the rock-cut stairs to reach the ancient temples atop the Rockfort,**Tiruvannamalai**: A spiritual town known for the Arunachaleswarar Temple, Tiruvannamalai is famous for its deep-rooted spirituality and the sacred mountain of Arunachala. Participate in the Girivalam (circumambulation) during full moon nights,**Yercaud**: A tranquil hill station in the Eastern Ghats, Yercaud is known for its coffee plantations, orange groves, and scenic viewpoints. Enjoy boating in Yercaud Lake, trekking in the Shevaroy Hills, and exploring Lady's Seat and Gent's Seat viewpoints."
            ],
            "context": [""]
        },
        {
            "tag": "Telangana_famous_places",
            "patterns": ["Tell me about famous places in Telangana", "What are the top tourist attractions in Telangana", "Can you recommend some places to visit in Telangana"],
            "responses": [
                "Telangana, known for its rich history, architectural marvels, and vibrant culture, offers several iconic tourist attractions. Here are some famous places to explore,**Charminar**: A symbol of Hyderabad, the Charminar is an iconic monument and mosque built in 1591 by Sultan Muhammad Quli Qutb Shah. Climb the minarets for panoramic views of the city and explore the bustling markets around it,**Golconda Fort**: A majestic fortress dating back to the 13th century, Golconda Fort is known for its impressive architecture, acoustic wonders, and light and sound shows. Don't miss the Fateh Darwaza and the Golconda Tombs,**Qutb Shahi Tombs**: Located near Golconda Fort, the Qutb Shahi Tombs are a group of majestic mausoleums built in Persian and Indian architectural styles. Explore the beautifully landscaped gardens and intricate carvings,**Chowmahalla Palace**: Once the seat of the Nizams of Hyderabad, Chowmahalla Palace is a grand architectural marvel featuring exquisite palaces, courtyards, and the Clock Tower. Visit the vintage car collection and the royal artifacts,**Salar Jung Museum**: One of the largest museums in India, the Salar Jung Museum houses an extensive collection of art, artifacts, and antiques from around the world. Explore the diverse exhibits, including sculptures, paintings, and textiles,**Ramoji Film City**: The world's largest integrated film studio complex, Ramoji Film City offers a glimpse into the world of cinema with film sets, live shows, and entertainment attractions. Enjoy guided tours and movie-themed experiences,**Birla Mandir**: Perched atop a hillock overlooking the city, Birla Mandir is a magnificent marble temple dedicated to Lord Venkateswara. Enjoy panoramic views of Hyderabad from the temple premises,**Nehru Zoological Park**: Spread over 380 acres, Nehru Zoological Park is home to a diverse range of wildlife species, including lions, tigers, elephants, and birds. Explore the safari park, aquarium, and nocturnal house,**Hussain Sagar Lake**: An artificial lake built in the heart of Hyderabad, Hussain Sagar Lake is a popular recreational spot offering boating, water sports, and a scenic promenade. Don't miss the giant Buddha statue installed on the lake,**Bhongir Fort**: Situated atop a monolithic rock hill, Bhongir Fort is known for its impressive architecture and panoramic views of the surrounding landscape. Trek to the top for a memorable adventure,**Warangal Fort**: A UNESCO World Heritage Site, Warangal Fort dates back to the Kakatiya dynasty and features majestic gateways, temples, and stone carvings. Explore the ruins and learn about the region's history,**Kakatiya Kala Thoranam**: Also known as the Warangal Gate, Kakatiya Kala Thoranam is a historical archway dating back to the 12th century. It symbolizes the architectural prowess of the Kakatiya dynasty,**Bhadrakali Temple**: Dedicated to Goddess Bhadrakali, the Bhadrakali Temple in Warangal is a significant religious site known for its ancient architecture and religious festivals,**Medak Cathedral**: Located in Medak town, the Medak Cathedral is one of the largest churches in India and features stunning Gothic Revival architecture, stained glass windows, and a majestic bell tower."
            ],
            "context": [""]
        },
        {
            "tag": "Tripura_famous_places",
            "patterns": ["Tell me about famous places in Tripura", "What are the top tourist attractions in Tripura", "Can you recommend some places to visit in Tripura"],
            "responses": [
                "Tripura, nestled in the northeastern part of India, boasts a rich cultural heritage and natural beauty. Here are some famous places to explore in Tripura,**Ujjayanta Palace**: Located in Agartala, Ujjayanta Palace is a majestic royal residence built by the Tripura king Maharaja Radha Kishore Manikya in the late 19th century. It now houses the Tripura State Museum, showcasing artifacts, paintings, and sculptures,**Neermahal**: Often referred to as the 'Lake Palace of Tripura', Neermahal is a stunning water palace situated in the middle of Rudrasagar Lake near Melaghar. Built by Maharaja Bir Bikram Kishore Manikya Bahadur in the 1930s, it reflects a unique blend of Hindu and Islamic architectural styles,**Unakoti**: Known for its rock-cut sculptures and ancient temples, Unakoti is a sacred pilgrimage site located in the Unakoti district of Tripura. The site features thousands of rock carvings and sculptures dating back to the 7th-9th centuries CE, including the iconic 'Unakotiswara Kal Bhairava' sculpture,**Sepahijala Wildlife Sanctuary**: Spread over an area of 18.53 square kilometers, Sepahijala Wildlife Sanctuary is a biodiversity hotspot known for its rich flora and fauna. Visitors can explore the sanctuary's dense forests, lakes, and watchtowers, and spot diverse wildlife species, including primates, deer, birds, and reptiles,**Jampui Hills**: Situated in the northern part of Tripura, Jampui Hills is a picturesque hill station known for its scenic landscapes, lush greenery, and pleasant climate. Visitors can enjoy panoramic views of the surrounding valleys, explore orange orchards, and experience the vibrant Mizo culture of the local communities,**Dumboor Lake**: Nestled amidst the verdant hills of Tripura, Dumboor Lake is a serene freshwater lake formed by the confluence of the rivers Gomati, Raima, and Sarma. It offers opportunities for boating, angling, and picnicking amidst tranquil surroundings,**Chabimura**: Also known as Devtamura, Chabimura is a sacred site located near Amarpur in Tripura, renowned for its rock carvings and natural beauty. The site features intricately carved rock panels depicting Hindu deities and mythological scenes, overlooking the Gomati River,**Pilak**: An archaeological site dating back to the 8th-12th centuries CE, Pilak is known for its ancient ruins, stone carvings, and Buddhist sculptures. Visitors can explore the remnants of Buddhist stupas, terracotta figurines, and the Mahadeva Temple, reflecting the region's rich historical and cultural heritage,**Rose Valley Amusement Park**: Located in Barmura near Agartala, the Rose Valley Amusement Park is a popular recreational destination offering thrilling rides, water slides, and entertainment attractions for visitors of all ages,**Kalapania Eco Park**: Situated near the town of Kailasahar, Kalapania Eco Park is a serene natural reserve featuring lush greenery, cascading waterfalls, and scenic viewpoints. Visitors can enjoy nature walks, birdwatching, and photography amidst tranquil surroundings."
            ],
            "context": [""]
        },
        {
            "tag": "Uttar_Pradesh_famous_places",
            "patterns": ["Tell me about famous places in Uttar Pradesh", "What are the top tourist attractions in Uttar Pradesh", "Can you recommend some places to visit in Uttar Pradesh"],
            "responses": [
                "Uttar Pradesh, the heartland of India, is renowned for its rich history, vibrant culture, and architectural marvels. Here are some famous places to explore in Uttar Pradesh,**Taj Mahal**: Located in Agra, the Taj Mahal is one of the most iconic monuments in the world and a UNESCO World Heritage Site. Built by Mughal Emperor Shah Jahan in memory of his wife Mumtaz Mahal, it is renowned for its exquisite architecture, white marble facade, and beautiful gardens,**Varanasi (Kashi)**: Varanasi, also known as Kashi, is one of the oldest continuously inhabited cities in the world and a major pilgrimage destination for Hindus. Situated on the banks of the Ganges River, it is known for its ghats, temples, spiritual ambiance, and vibrant culture,**Fatehpur Sikri**: A UNESCO World Heritage Site, Fatehpur Sikri is a historic city founded by Emperor Akbar in the 16th century. It served as the capital of the Mughal Empire for a brief period and is known for its magnificent palaces, mosques, and courtyards,**Agra Fort**: Situated in Agra, the Agra Fort is a UNESCO World Heritage Site and a symbol of Mughal grandeur. Built by Emperor Akbar, it features impressive palaces, halls, and gardens, offering panoramic views of the Taj Mahal,**Ayodhya**: Ayodhya is a sacred city revered by Hindus as the birthplace of Lord Rama. It is known for its temples, including the Ram Janmabhoomi Temple, Hanuman Garhi, and Kanak Bhawan,**Allahabad (Prayagraj)**: Allahabad, now officially known as Prayagraj, is a historic city located at the confluence of the Ganges, Yamuna, and Saraswati rivers. It hosts the Kumbh Mela, one of the largest religious gatherings in the world, and is known for its Sangam, Triveni Sangam, and historic monuments,**Mathura and Vrindavan**: Mathura and Vrindavan are revered as the birthplace and childhood abode of Lord Krishna. These twin cities are dotted with temples, ashrams, and ghats, attracting devotees and tourists from around the world,**Lucknow**: The capital city of Uttar Pradesh, Lucknow is known for its rich cultural heritage, nawabi cuisine, and architectural splendors. Key attractions include the Bara Imambara, Chota Imambara, Rumi Darwaza, and British Residency,**Kushinagar**: Kushinagar is a sacred Buddhist pilgrimage site where Lord Buddha attained Mahaparinirvana (final enlightenment). It features stupas, monasteries, and the famous Mahaparinirvana Temple,**Sarnath**: Sarnath is an important Buddhist site near Varanasi, where Lord Buddha delivered his first sermon after attaining enlightenment. The site features ancient stupas, monasteries, and the Dhamek Stupa,**Jhansi Fort**: Located in Jhansi, the Jhansi Fort is a historic fortress associated with the valor of Rani Lakshmi Bai of Jhansi. It played a significant role in the Indian Rebellion of 1857 against British rule,**Meerut**: Meerut is an ancient city with historical significance, known for its role in the Indian freedom struggle. It is home to monuments like the Augarnath Temple, Jama Masjid, and St. John's Church,**Gorakhpur**: Gorakhpur is a city with cultural and historical importance, known for its Gorakhnath Temple dedicated to Guru Gorakhnath. It also serves as a gateway to the Kushinagar pilgrimage site,**Chitrakoot**: Chitrakoot is a sacred town associated with the epic Ramayana and revered as the place where Lord Rama, Sita, and Lakshmana spent a significant part of their exile. It features temples, ghats, and natural beauty,**Naimisharanya**: Naimisharanya is a sacred pilgrimage site mentioned in Hindu scriptures, believed to be the abode of Lord Vishnu. It is known for its temples, ashrams, and the confluence of rivers,**Bareilly**: Bareilly is a city known for its vibrant culture, music, and sweets. It is famous for the Alakhnath Temple, Dargah-e-Ala Hazrat, and annual festivals like the Bareilly Sharif Urs,**Sarnath**: Sarnath is an important Buddhist site near Varanasi, where Lord Buddha delivered his first sermon after attaining enlightenment. The site features ancient stupas, monasteries, and the Dhamek Stupa,**Jhansi Fort**: Located in Jhansi, the Jhansi Fort is a historic fortress associated with the valor of Rani Lakshmi Bai of Jhansi. It played a significant role in the Indian Rebellion of 1857 against British rule,**Meerut**: Meerut is an ancient city with historical significance, known for its role in the Indian freedom struggle. It is home to monuments like the Augarnath Temple, Jama Masjid, and St. John's Church,**Gorakhpur**: Gorakhpur is a city with cultural and historical importance, known for its Gorakhnath Temple dedicated to Guru Gorakhnath. It also serves as a gateway to the Kushinagar pilgrimage site,**Chitrakoot**: Chitrakoot is a sacred town associated with the epic Ramayana and revered as the place where Lord Rama, Sita, and Lakshmana spent a significant part of their exile. It features temples, ghats, and natural beauty,**Naimisharanya**: Naimisharanya is a sacred pilgrimage site mentioned in Hindu scriptures, believed to be the abode of Lord Vishnu. It is known for its temples, ashrams, and the confluence of rivers,**Bareilly**: Bareilly is a city known for its vibrant culture, music, and sweets. It is famous for the Alakhnath Temple, Dargah-e-Ala Hazrat, and annual festivals like the Bareilly Sharif Urs."
            ],
            "context": [""]
        },
        {
            "tag": "Uttarakhand_famous_places",
            "patterns": ["Tell me about famous places in Uttarakhand", "What are the top tourist attractions in Uttarakhand", "Can you recommend some places to visit in Uttarakhand"],
            "responses": [
                "Uttarakhand, often referred to as the 'Land of the Gods', is renowned for its scenic beauty, spiritual significance, and adventure opportunities. Here are some famous places to explore in Uttarakhand,**Nainital**: Nainital is a charming hill station known for its emerald lake, lush forests, and panoramic views of the surrounding Himalayan peaks. Visitors can enjoy boating on Naini Lake, explore Naina Devi Temple, and shop at the bustling Mall Road,**Mussoorie**: Mussoorie, also known as the 'Queen of Hills', is a popular hill station famous for its scenic beauty, colonial charm, and adventure activities. Key attractions include Kempty Falls, Gun Hill, Lal Tibba, and the Cloud's End viewpoint,**Rishikesh**: Rishikesh is a spiritual town located on the banks of the Ganges River, known as the 'Yoga Capital of the World'. It offers opportunities for yoga, meditation, white water rafting, and exploring ashrams like Parmarth Niketan and the Beatles Ashram,**Haridwar**: Haridwar is one of the holiest cities in India, known for its sacred ghats, temples, and vibrant Ganga Aarti ceremonies. Visitors can take a dip in the holy waters of the Ganges, visit Har Ki Pauri, and seek blessings at Mansa Devi Temple,**Dehradun**: Dehradun, the capital city of Uttarakhand, is known for its pleasant climate, educational institutions, and scenic beauty. Key attractions include Robber's Cave, Sahastradhara, Malsi Deer Park, and the Forest Research Institute,**Jim Corbett National Park**: Jim Corbett National Park is India's oldest national park and a haven for wildlife enthusiasts. It is known for its population of Bengal tigers, along with elephants, leopards, and diverse bird species. Visitors can enjoy jeep safaris, elephant rides, and birdwatching,**Auli**: Auli is a picturesque hill station known for its pristine skiing slopes, panoramic views of the Himalayas, and lush meadows. It is a popular destination for skiing, snowboarding, and trekking, offering breathtaking vistas of Nanda Devi and other peaks,**Valley of Flowers National Park**: Valley of Flowers National Park is a UNESCO World Heritage Site known for its stunning alpine meadows, vibrant flowers, and rich biodiversity. It is home to rare species like the Himalayan blue poppy and the snow leopard,**Kedarnath**: Kedarnath is a sacred pilgrimage town located in the Garhwal Himalayas, known for its ancient Kedarnath Temple dedicated to Lord Shiva. It is one of the Char Dham pilgrimage sites and offers breathtaking views of the surrounding peaks,**Badrinath**: Badrinath is another important pilgrimage town in Uttarakhand, revered for its Badrinath Temple dedicated to Lord Vishnu. Situated on the banks of the Alaknanda River, it is part of the Char Dham circuit and attracts thousands of devotees each year,**Gangotri**: Gangotri is a holy town located in the Garhwal Himalayas, known as the source of the Ganges River. It is home to the sacred Gangotri Temple and offers stunning views of the surrounding mountains and glaciers,**Yamunotri**: Yamunotri is a sacred pilgrimage site located in the Uttarkashi district, known for its Yamunotri Temple dedicated to the goddess Yamuna. It is the source of the Yamuna River and offers serene surroundings amidst the Himalayan peaks."
            ],
            "context": [""]
        },
        {
            "tag": "West_Bengal_famous_places",
            "patterns": ["Tell me about famous places in West Bengal", "What are the top tourist attractions in West Bengal", "Can you recommend some places to visit in West Bengal"],
            "responses": [
                "West Bengal, located in eastern India, is known for its rich culture, historical landmarks, and diverse landscapes. Here are some famous places to explore in West Bengal,**Kolkata**: Kolkata, the capital city of West Bengal, is a vibrant metropolis known for its colonial architecture, cultural festivals, and literary heritage. Key attractions include Victoria Memorial, Howrah Bridge, Dakshineswar Kali Temple, and the vibrant markets of New Market and College Street,**Darjeeling**: Darjeeling is a picturesque hill station known for its tea plantations, stunning views of the Himalayas, and the iconic Darjeeling Himalayan Railway (Toy Train). Visitors can explore tea estates, enjoy a ride on the toy train, and visit attractions like Tiger Hill and the Padmaja Naidu Himalayan Zoological Park,**Sundarbans National Park**: Sundarbans National Park is a UNESCO World Heritage Site and the largest mangrove forest in the world. It is known for its Royal Bengal Tigers, diverse flora and fauna, and boat safaris through the mangrove creeks,**Sundarbans Tiger Reserve**: Sundarbans Tiger Reserve is part of the Sundarbans mangrove forest and a crucial habitat for the endangered Bengal tiger. Visitors can take boat safaris to spot tigers, crocodiles, and various bird species in their natural habitat,**Digha**: Digha is a popular beach destination located on the Bay of Bengal coast, known for its sandy beaches, shallow waters, and seafood delicacies. It offers opportunities for swimming, sunbathing, and beachside activities,**Shantiniketan**: Shantiniketan is a tranquil town known for its association with Nobel laureate Rabindranath Tagore and Visva-Bharati University. Visitors can explore the university campus, attend cultural events, and immerse themselves in the artistic and intellectual legacy of Tagore,**Murshidabad**: Murshidabad is a historical city on the banks of the Bhagirathi River, known for its Mughal architecture, palaces, and monuments. Key attractions include Hazarduari Palace, Katra Mosque, Nashipur Rajbari, and the scenic views along the river,**Siliguri**: Siliguri is a bustling city known as the gateway to the northeastern states and the foothills of the Himalayas. It serves as a major transportation hub and offers access to nearby attractions like Darjeeling, Sikkim, and Bhutan,**Kalimpong**: Kalimpong is a charming hill station known for its serene ambiance, Buddhist monasteries, and panoramic views of the Himalayas. Visitors can explore flower nurseries, trekking trails, and attractions like Durpin Monastery and Deolo Hill,**Bishnupur**: Bishnupur is a historic town known for its terracotta temples, music, and handicrafts. Visitors can explore the intricate terracotta artwork at temples like Jor Bangla Temple and Rasmancha, and shop for unique terracotta artifacts,**Jaldapara National Park**: Jaldapara National Park is located in the foothills of the Eastern Himalayas and is known for its population of Indian one-horned rhinoceroses. Visitors can enjoy elephant safaris, birdwatching, and nature walks in the park,**Bankura**: Bankura is a cultural hub known for its folk art, music, and historical sites. Key attractions include the terracotta temples of Bishnupur, Susunia Hill, Mukutmanipur Dam, and the annual Gangadhar Mela,**Chandannagar**: Chandannagar is a former French colony known for its colonial architecture, Durga Puja celebrations, and cultural festivals. Visitors can explore landmarks like Chandannagar Strand, Sacred Heart Church, and the French Colony Museum,**Hooghly**: Hooghly is a historical district known for its colonial heritage, temples, and riverside ghats. Key attractions include the Imambara at Hooghly, Hangseswari Temple, Bandel Church, and the Dutch Cemetery at Chinsurah,**Santiniketan Baul Music Festival**: Santiniketan Baul Music Festival is an annual event celebrating the Baul music tradition of West Bengal, featuring performances by traditional Baul musicians, cultural programs, and workshops on Baul philosophy and music,**Chilapata Forest**: Chilapata Forest is a dense forest located near Jaldapara National Park, known for its diverse wildlife, including elephants, leopards, and deer. Visitors can enjoy jungle safaris, birdwatching, and camping in the forest,**Cooch Behar**: Cooch Behar is a historic town known for its royal heritage, palaces, and architectural landmarks."
            ],
            "context": [""]
        },
        {
            "tag": "Andaman_and_Nicobar_Islands_famous_places",
            "patterns": ["Tell me about famous places in Andaman and Nicobar Islands", "What are the top tourist attractions in Andaman and Nicobar Islands", "Can you recommend some places to visit in Andaman and Nicobar Islands"],
            "responses": [
                "The Andaman and Nicobar Islands, a tropical paradise in the Bay of Bengal, are known for their pristine beaches, coral reefs, and rich marine biodiversity. Here are some famous places to explore in Andaman and Nicobar Islands,**Cellular Jail National Memorial**: Cellular Jail, also known as Kālā Pānī, is a historic colonial prison located in Port Blair. It served as a notorious British penal colony where Indian freedom fighters were imprisoned. Today, it is a national memorial and museum showcasing the history of India's struggle for independence,**Radhanagar Beach (Havelock Island)**: Radhanagar Beach is consistently ranked among the best beaches in Asia for its white sand, turquoise waters, and stunning sunset views. Visitors can relax on the pristine shore, swim in the crystal-clear waters, and indulge in water sports like snorkeling and scuba diving,**Ross Island**: Ross Island, once the administrative headquarters of the British in the Andaman Islands, is now a picturesque ruin with remnants of colonial buildings and lush greenery. Visitors can explore historical sites like the British Commissioner's residence, church, and cemetery, amidst the island's natural beauty,**Elephant Beach (Havelock Island)**: Elephant Beach is known for its vibrant coral reefs, marine life, and thrilling water activities. Visitors can enjoy snorkeling, diving, and glass-bottom boat rides to witness the colorful underwater world teeming with fish, corals, and other marine creatures,**Neil Island**: Neil Island, also known as Shaheed Dweep, is famous for its serene beaches, clear waters, and relaxed ambiance. Visitors can explore attractions like Bharatpur Beach, Laxmanpur Beach, and Natural Bridge, and enjoy activities like swimming, sunbathing, and beachcombing,**Baratang Island**: Baratang Island is known for its natural attractions, including limestone caves, mangrove forests, and mud volcanoes. Visitors can take a boat ride through the mangroves to reach destinations like the limestone caves at Baratang Jetty and witness unique geological formations and vibrant ecosystems,**North Bay Island**: North Bay Island, also known as Coral Island, is renowned for its coral reefs, underwater marine life, and adventure sports. Visitors can engage in activities like snorkeling, sea walking, and glass-bottom boat rides to explore the colorful coral gardens and encounter diverse marine species,**Chidiya Tapu**: Chidiya Tapu, or Bird Island, is a scenic spot known for its biodiversity, sunset views, and birdwatching opportunities. Visitors can trek through the forest trails, spot endemic bird species, and enjoy panoramic views of the coastline and surrounding islands,**Mahatma Gandhi Marine National Park**: Mahatma Gandhi Marine National Park is a protected area encompassing coral reefs, mangroves, and tropical rainforests. Visitors can explore the marine ecosystem through activities like snorkeling, diving, and glass-bottom boat rides and encounter a variety of marine life, including corals, fish, turtles, and dolphins,**Viper Island**: Viper Island, named after the ship HMS Viper, is known for its historical significance and scenic beauty. Visitors can explore attractions like the ruins of the old jail, the gallows where prisoners were executed, and enjoy views of the surrounding azure waters,**Mount Harriet National Park**: Mount Harriet National Park, located on South Andaman Island, is known for its lush forests, diverse wildlife, and panoramic views from the summit. Visitors can trek through the jungle trails, spot endemic bird species, and enjoy breathtaking vistas of the Andaman Sea and surrounding islands,**Wandoor Beach**: Wandoor Beach is a tranquil stretch of coastline known for its soft sands, clear waters, and coral reefs. It serves as the gateway to the Mahatma Gandhi Marine National Park and offers opportunities for swimming, sunbathing, and picnicking amidst natural beauty,**Anthropological Museum**: The Anthropological Museum in Port Blair showcases the cultural heritage and tribal life of the indigenous tribes of the Andaman and Nicobar Islands. Visitors can explore exhibits on tribal artifacts, lifestyle, crafts, and traditions, providing insights into the island's rich cultural diversity,**Samudrika Naval Marine Museum**: Samudrika Naval Marine Museum is a maritime museum in Port Blair operated by the Indian Navy. It features exhibits on the marine life, geography, archaeology, and tribal culture of the Andaman and Nicobar Islands, offering educational insights into the region's natural and cultural heritage."
            ],
            "context": [""]
        },
        {
            "tag": "Chandigarh_famous_places",
            "patterns": ["Tell me about famous places in Chandigarh", "What are the top tourist attractions in Chandigarh", "Can you recommend some places to visit in Chandigarh"],
            "responses": [
                "Chandigarh, the capital of the northern Indian states of Punjab and Haryana, is known for its modernist architecture and urban design. Here are some famous places to explore in Chandigarh,**Rock Garden**: Rock Garden, also known as Nek Chand's Rock Garden, is a sculpture garden created by artist Nek Chand using recycled materials like broken ceramics, glass, and industrial waste. It features a labyrinth of walkways, waterfalls, sculptures, and art installations, offering a unique blend of creativity and environmentalism,**Sukhna Lake**: Sukhna Lake is a man-made reservoir located at the foothills of the Shivalik range. It is a popular spot for recreational activities like boating, picnicking, and jogging, offering scenic views of the surrounding hills and lush greenery,**Rose Garden**: Zakir Hussain Rose Garden, Asia's largest rose garden, is spread over 30 acres and houses thousands of rose bushes representing over 1,600 varieties. Visitors can stroll through the landscaped gardens, admire the vibrant blooms, and enjoy the tranquil ambiance,**Capitol Complex**: Capitol Complex is a UNESCO World Heritage Site designed by Swiss-French architect Le Corbusier. It comprises three main buildings: the Secretariat, the Legislative Assembly, and the High Court, along with open spaces and water features. The complex symbolizes modernist architecture and the city's administrative hub,**Chandigarh Capitol Plaza**: Chandigarh Capitol Plaza, also known as Plaza Sector 17, is a bustling shopping and commercial district in the heart of Chandigarh. It features a pedestrian-friendly promenade lined with shops, restaurants, cafes, and entertainment venues, offering a vibrant urban experience,**Le Corbusier Centre**: Le Corbusier Centre is a museum dedicated to the life and work of architect Le Corbusier, showcasing his designs, drawings, models, and photographs related to Chandigarh's planning and development. Visitors can learn about the city's architectural heritage and Le Corbusier's influence on modern urban planning,**Government Museum and Art Gallery**: Government Museum and Art Gallery is a cultural institution featuring collections of art, archaeology, and natural history. It houses exhibits on ancient artifacts, Gandhara sculptures, Indian miniature paintings, contemporary art, and the history of Chandigarh,**Terraced Garden**: Terraced Garden, also known as Sector 33 Garden, is a well-maintained park featuring terraced lawns, flower beds, sculptures, and water fountains. It offers a serene environment for leisurely walks, picnics, and photography amidst lush greenery and colorful blooms,**International Dolls Museum**: International Dolls Museum is a unique museum showcasing a diverse collection of dolls and puppets from around the world. It features exhibits on traditional costumes, customs, and cultures, providing a fascinating glimpse into global heritage and craftsmanship,**Japanese Garden**: Japanese Garden, also known as Chandigarh's Sector 31 Garden, is inspired by Japanese landscaping principles and features Zen gardens, pagodas, water bodies, and bonsai trees. It offers a tranquil retreat from the city's hustle and bustle, with serene pathways and meditation spots,**Museum of Evolution of Life**: Museum of Evolution of Life is dedicated to showcasing the evolution of life on Earth, with exhibits on fossils, skeletons, and evolutionary processes. It offers educational insights into the history of life forms and the natural world,**Gurudwara Nada Sahib**: Gurudwara Nada Sahib is a Sikh religious site located on the banks of the Ghaggar River. It commemorates the visit of Guru Gobind Singh, the tenth Sikh Guru, and offers spiritual solace and community services to devotees,**Chhatbir Zoo**: Chhatbir Zoo, also known as Mahendra Chaudhary Zoological Park, is a wildlife sanctuary located on the outskirts of Chandigarh. It houses a variety of animal species, including lions, tigers, elephants, and birds, and offers opportunities for wildlife viewing and conservation education,**Morni Hills**: Morni Hills is a scenic hill station located near Chandigarh, known for its verdant landscapes, lakes, and trekking trails amidst the Shivalik Range. It offers breathtaking views of the surrounding mountains and valleys, making it a popular weekend getaway,**Fun City**: Fun City is an amusement park located in Ramgarh, near Chandigarh, offering a range of rides, water slides, and recreational activities for visitors of all ages. It provides a fun-filled environment for families and thrill-seekers to enjoy a day of entertainment and adventure."
            ],
            "context": [""]
        },
        {
            "tag": "Dadra_and_Nagar_Haveli_and_Daman_and_Diu_famous_places",
            "patterns": ["Tell me about famous places in Dadra and Nagar Haveli and Daman and Diu", "What are the top tourist attractions in Dadra and Nagar Haveli and Daman and Diu", "Can you recommend some places to visit in Dadra and Nagar Haveli and Daman and Diu"],
            "responses": [
                "Dadra and Nagar Haveli and Daman and Diu, two union territories situated on the western coast of India, offer a blend of natural beauty, historical sites, and cultural heritage. Here are some famous places to explore in Dadra and Nagar Haveli and Daman and Diu,**Diu Fort**: Diu Fort, located on the coast of Diu Island, is a historic Portuguese fort built in the 16th century. It offers panoramic views of the Arabian Sea and houses various structures like churches, lighthouses, and cannons, reflecting the region's colonial past,**Naida Caves**: Naida Caves are natural limestone caves located near Diu Fort, known for their intricate rock formations, tunnels, and openings. Visitors can explore the caves, marvel at the geological features, and enjoy photography amidst the cool interiors,**Gangeshwar Mahadev Temple**: Gangeshwar Mahadev Temple is a sacred Hindu temple located in Diu, known for its unique setting amidst the rocks and the rhythmic sound of waves crashing against the shore. It is dedicated to Lord Shiva and attracts devotees and tourists seeking spiritual solace,**Diu Museum**: Diu Museum, housed in the St. Thomas Church building, showcases exhibits on the history, culture, and heritage of Diu. It features artifacts, sculptures, photographs, and documents related to the region's Portuguese rule, maritime history, and local traditions,**Chakratirth Beach**: Chakratirth Beach is a serene and secluded beach located in Diu, offering pristine sandy shores, clear blue waters, and stunning sunsets. It is an ideal spot for relaxation, sunbathing, and swimming away from the crowds,**Jampore Beach**: Jampore Beach is a picturesque beach located in Daman, known for its tranquil ambiance, gentle waves, and golden sands. Visitors can enjoy leisurely walks, beach games, and water sports like jet skiing and parasailing,**Daman Fort**: Daman Fort, also known as Fort of St. Jerome, is a historic fortification built by the Portuguese in the 16th century. It features ramparts, bastions, and cannons, offering panoramic views of the Arabian Sea and the city of Daman,**Devka Beach**: Devka Beach is a popular beach destination in Daman, known for its rocky shoreline, tidal pools, and scenic beauty. It offers opportunities for swimming, beachcombing, and enjoying local snacks and refreshments at the nearby stalls,**Silvassa Vasona Lion Safari**: Silvassa Vasona Lion Safari is a wildlife sanctuary located near Silvassa, offering safari tours to observe Asiatic lions in their natural habitat. It is home to other animal species like deer, antelopes, and birds, providing a unique wildlife experience,**Tribal Cultural Museum**: Tribal Cultural Museum, located in Silvassa, showcases the rich cultural heritage and traditions of the tribal communities in Dadra and Nagar Haveli. It features exhibits on tribal artifacts, costumes, rituals, and lifestyle, offering insights into their unique way of life,**Swaminarayan Temple**: Swaminarayan Temple is a Hindu temple located in Silvassa, dedicated to Lord Swaminarayan. It is known for its intricate architecture, colorful murals, and spiritual atmosphere, attracting devotees and tourists seeking blessings and tranquility,**Island Garden**: Island Garden, also known as Vandhara Udyan, is a beautiful garden located in Silvassa, featuring lush greenery, manicured lawns, and flower beds. It offers a peaceful retreat for nature lovers, with walking trails, seating areas, and children's play areas,**Hirwa Van Garden**: Hirwa Van Garden is a scenic park located in Silvassa, known for its dense forest cover, winding pathways, and serene ambiance. It offers opportunities for nature walks, birdwatching, and enjoying the tranquil surroundings amidst tall trees and chirping birds,**Bal Udyan**: Bal Udyan is a children's park located in Silvassa, offering playground equipment, slides, swings, and other recreational facilities for kids. It provides a fun-filled environment for families to enjoy picnics, outdoor activities, and quality time together,**Moti Daman**: Moti Daman is a historic area in Daman"
            ]
        },
        {
            "tag": "Lakshadweep_famous_places",
            "patterns": ["Tell me about famous places in Lakshadweep", "What are the top tourist attractions in Lakshadweep", "Can you recommend some places to visit in Lakshadweep"],
            "responses": [
                "Lakshadweep, a tropical archipelago in the Arabian Sea, is renowned for its pristine beaches, crystal-clear waters, and vibrant marine life. Here are some famous places to explore in Lakshadweep,**Agatti Island**: Agatti Island is the gateway to Lakshadweep and offers breathtaking views of turquoise lagoons and coral reefs. Visitors can indulge in water sports like snorkeling, scuba diving, and kayaking amidst the vibrant marine ecosystem,**Bangaram Island**: Bangaram Island is known for its secluded beaches, swaying palm trees, and serene ambiance. It is a paradise for nature lovers and offers opportunities for beachcombing, sunbathing, and enjoying spectacular sunsets,**Kavaratti Island**: Kavaratti Island is the administrative capital of Lakshadweep and is famous for its pristine beaches, vibrant coral reefs, and rich marine biodiversity. Visitors can explore the lighthouse, mosques, and marine aquarium, and enjoy water sports like snorkeling and glass-bottom boat rides,**Kalpeni Island**: Kalpeni Island is renowned for its stunning coral reefs, lagoons, and white sandy beaches. It offers excellent snorkeling and scuba diving opportunities, allowing visitors to witness colorful coral gardens, tropical fish, and marine life,**Minicoy Island**: Minicoy Island, also known as Maliku, is the southernmost island in Lakshadweep and is famous for its picturesque landscapes, coral reefs, and cultural heritage. Visitors can explore the traditional Maliku dance, lighthouse, and embark on boat excursions to witness spinner dolphins and turtles,**Agatti Lagoon**: Agatti Lagoon is a pristine lagoon known for its crystal-clear waters, coral reefs, and diverse marine life. Visitors can enjoy activities like snorkeling, diving, and swimming in the tranquil lagoon surrounded by untouched natural beauty,**Kadmat Island**: Kadmat Island is famous for its unspoiled beaches, turquoise lagoons, and abundant coconut groves. It offers opportunities for water sports like snorkeling, diving, and kayaking, allowing visitors to explore the vibrant underwater world teeming with marine life,**Andrott Island**: Andrott Island is the largest island in Lakshadweep and is known for its historical significance and natural beauty. Visitors can explore the Buddhist archaeological sites, mosques, and pristine beaches, and indulge in water activities like snorkeling and fishing,**Pitti Island**: Pitti Island is a bird sanctuary located in the northern part of Lakshadweep, known for its diverse avian species and nesting sites. Visitors can witness migratory birds like terns, gulls, and herons, making it a paradise for birdwatchers and nature enthusiasts,**Suheli Par**: Suheli Par, also known as Cheriyam Island, is an uninhabited island in Lakshadweep known for its pristine beaches, coral reefs, and marine life. It offers excellent opportunities for snorkeling, diving, and exploring the untouched natural surroundings,**Tinnakara Island**: Tinnakara Island is a secluded paradise known for its pristine beaches, turquoise lagoons, and coral reefs. Visitors can relax on the sandy shores, indulge in water sports like snorkeling and kayaking, and enjoy the serene ambiance of this tranquil island getaway."
            ],
            "context": [""]
        },
        {
            "tag": "Delhi_famous_places",
            "patterns": ["Tell me about famous places in Delhi", "What are the top tourist attractions in Delhi", "Can you recommend some places to visit in Delhi"],
            "responses": [
                "Delhi, the capital city of India, is a vibrant metropolis steeped in history, culture, and diversity. Here are some famous places to explore in Delhi,**Red Fort**: The Red Fort, a UNESCO World Heritage Site, is an iconic symbol of Delhi's rich Mughal heritage. Built by Emperor Shah Jahan, it showcases stunning architecture, lush gardens, and historic significance,**Qutub Minar**: Qutub Minar is the tallest brick minaret in the world, dating back to the 12th century. It is surrounded by ancient ruins, including the Iron Pillar of Delhi, and is a testament to the city's architectural grandeur,**India Gate**: India Gate is a war memorial dedicated to the Indian soldiers who died during World War I. It is surrounded by lush lawns and is a popular spot for picnics, leisurely walks, and evening strolls,**Lotus Temple**: The Lotus Temple, also known as the Bahá'í House of Worship, is renowned for its distinctive lotus-shaped architecture and tranquil ambiance. Visitors of all faiths are welcome to meditate and pray in this serene space,**Humayun's Tomb**: Humayun's Tomb is a majestic mausoleum built in the 16th century, serving as the resting place of Emperor Humayun. It is known for its Persian-inspired architecture, lush gardens, and intricate marble work,**Akshardham Temple**: Akshardham Temple is a modern Hindu temple complex dedicated to Lord Swaminarayan. It features stunning architecture, intricate carvings, and a sprawling cultural campus showcasing Indian art, culture, and spirituality,**Gurudwara Bangla Sahib**: Gurudwara Bangla Sahib is one of the most prominent Sikh temples in Delhi, known for its golden dome, serene sarovar (pond), and community kitchen serving free meals (langar) to visitors,**Jama Masjid**: Jama Masjid is one of the largest and most revered mosques in India, built by Emperor Shah Jahan. It features intricate marble domes, towering minarets, and a spacious courtyard capable of accommodating thousands of worshippers,**Chandni Chowk**: Chandni Chowk is one of the oldest and busiest markets in Delhi, renowned for its narrow lanes, vibrant bazaars, and delectable street food. Visitors can explore the bustling market, sample local delicacies, and shop for traditional goods, **National Museum**: The National Museum is the largest museum in India, housing a vast collection of artifacts, artworks, and relics spanning thousands of years of Indian history and culture. It offers insights into the country's rich heritage and diverse heritage,**Raj Ghat**: Raj Ghat is a memorial dedicated to Mahatma Gandhi, the Father of the Nation, marking the spot of his cremation. Surrounded by tranquil gardens, it serves as a place for reflection, homage, and paying respects to the great leader,**Lodi Gardens**: Lodi Gardens is a peaceful oasis in the heart of Delhi, featuring lush lawns, historic monuments, and ancient tombs dating back to the 15th century. It is a popular spot for picnics, morning walks, and photography,**National Zoological Park**: The National Zoological Park, also known as Delhi Zoo, is home to a diverse range of wildlife species, including exotic animals, birds, and reptiles. It offers educational and recreational opportunities for visitors of all ages,**Hauz Khas Village**: Hauz Khas Village is a trendy neighborhood known for its eclectic mix of cafes, restaurants, boutiques, and art galleries. Visitors can explore the vibrant cultural scene, shop for unique souvenirs, and dine at chic eateries,**Dilli Haat**: Dilli Haat is a cultural bazaar showcasing handicrafts, handlooms, and traditional artifacts from across India's diverse regions. It offers a vibrant shopping experience, live cultural performances, and culinary delights from different states,**Agrasen ki Baoli**: Agrasen ki Baoli is an ancient stepwell dating back to the 14th century, known for its unique architecture and historical significance. It is a tranquil retreat amidst the bustling city, offering a glimpse into Delhi's architectural heritage,**Rashtrapati Bhavan**: Rashtrapati Bhavan, the official residence of the President of India, is an architectural marvel showcasing colonial-era grandeur and meticulous gardens. Visitors can explore the sprawling estate and marvel at its majestic architecture,**Connaught Place**: Connaught Place is a bustling commercial hub in Delhi, featuring circular colonnades, upscale boutiques, eateries, and entertainment venues. It is a popular destination for shopping, dining, and socializing,**Gandhi Smriti**: Gandhi Smriti is a museum and memorial dedicated to Mahatma Gandhi, located at the spot where he spent his last days. It offers insights into his life, philosophy, and contributions to India's freedom struggle,**Swaminarayan Akshardham Water Show**: The Swaminarayan Akshardham Water Show is a mesmerizing multimedia fountain show held at Akshardham Temple, depicting ancient Indian tales, legends, and spiritual messages through light, sound, and water effects."
            ],
            "context": [""]
        },
        {
            "tag": "Puducherry_famous_places",
            "patterns": ["Tell me about famous places in Puducherry", "What are the top tourist attractions in Puducherry", "Can you recommend some places to visit in Puducherry"],
            "responses": [
                "Puducherry, also known as Pondicherry, is a charming union territory on the southeastern coast of India, known for its French colonial heritage, serene beaches, and spiritual ambiance. Here are some famous places to explore in Puducherry,**Promenade Beach**: Promenade Beach, also known as Rock Beach, is a picturesque seafront promenade in Puducherry, offering stunning views of the Bay of Bengal. Visitors can enjoy leisurely strolls, beachside picnics, and witnessing the mesmerizing sunrise and sunset,**Auroville**: Auroville is an international township and spiritual community founded on the principles of unity, peace, and sustainable living. Visitors can explore the Matrimandir, an architectural marvel and meditation center, and learn about Auroville's vision of human unity,**Paradise Beach**: Paradise Beach, also known as Plage Paradiso, is a secluded and pristine beach located on Chunnambar River's backwaters. Accessible only by boat, it offers tranquility, clear waters, and opportunities for swimming, sunbathing, and beachside relaxation,**Aurobindo Ashram**: Aurobindo Ashram, founded by Sri Aurobindo and the Mother, is a spiritual center and retreat in the heart of Puducherry. Visitors can explore the ashram's serene surroundings, attend meditation sessions, and learn about Sri Aurobindo's teachings,**French Quarter (White Town)**: The French Quarter, also known as White Town, is a charming colonial district in Puducherry, characterized by its vibrant streets, colorful buildings, and French architecture. Visitors can stroll along Rue Romain Rolland and Rue Saint Louis, explore boutiques, cafes, and art galleries,**Basilica of the Sacred Heart of Jesus**: The Basilica of the Sacred Heart of Jesus is a majestic Roman Catholic church in Puducherry, renowned for its Gothic-style architecture, stained glass windows, and spiritual ambiance. It is a significant pilgrimage site for devotees,**Serenity Beach**: Serenity Beach is a serene and less crowded beach located a few kilometers north of Puducherry town. It offers golden sands, gentle waves, and opportunities for surfing, beach volleyball, and leisurely walks along the coast,**Botanical Garden**: The Botanical Garden, also known as Le Jardin Botanique, is a lush green oasis in Puducherry, featuring diverse flora, fountains, and walking paths. It is home to rare plant species, an aquarium, and a toy train ride for children,**Old Lighthouse**: The Old Lighthouse, located on the Promenade Beach, is a historic landmark offering panoramic views of Puducherry's coastline and the cityscape. Visitors can climb to the top for breathtaking vistas and learn about the lighthouse's maritime history,**Ousteri Lake**: Ousteri Lake, also known as Osudu Lake, is a tranquil freshwater lake located on the outskirts of Puducherry. It is a haven for birdwatchers, with numerous migratory bird species visiting the lake during the winter months. Visitors can enjoy boat rides and nature walks along the lake's shore,**Manakula Vinayagar Temple**: Manakula Vinayagar Temple is a revered Hindu temple dedicated to Lord Ganesha, located in the heart of Puducherry. It is known for its ancient architecture, intricate carvings, and colorful sculptures depicting various Hindu deities,**Chunnambar Boat House**: Chunnambar Boat House, also known as Paradise Island, offers boat rides and cruises along the backwaters of Chunnambar River. Visitors can enjoy scenic views, spot migratory birds, and explore the serene beauty of the surrounding mangrove forests,**Puducherry Museum**: Puducherry Museum showcases the region's history, culture, and heritage through a diverse collection of artifacts, sculptures, and archaeological finds. It offers insights into Puducherry's colonial past, maritime heritage, and traditional art forms,**Goubert Market**: Goubert Market is a bustling marketplace in Puducherry, offering a wide range of goods, including fresh produce, spices, clothing, and souvenirs. Visitors can explore the vibrant stalls, interact with local vendors, and experience the city's cultural diversity,**Jawahar Toy Museum**: Jawahar Toy Museum is a unique attraction in Puducherry, showcasing a vast collection of traditional Indian toys, dolls, and artifacts. It provides an educational and nostalgic experience for visitors of all ages, highlighting India's rich cultural heritage,**Bharathi Park**: Bharathi Park, also known as Government Park, is a tranquil green space in the heart of Puducherry, featuring manicured lawns, shady trees, and walking paths. It offers a peaceful retreat amidst the bustling city and is ideal for leisurely strolls and relaxation,**Arikamedu Archaeological Site**: Arikamedu Archaeological Site is an ancient port town located on the outskirts of Puducherry, showcasing remnants of Roman trading settlements dating back to the 1st century CE. It offers insights into the region's maritime history and cross-cultural exchanges,**Gandhi Statue**: The Gandhi Statue, located on the Promenade Beach, is a bronze sculpture honoring Mahatma Gandhi, the Father of the Nation."
            ]
        },
        {
            "tag": "get_gps_location",
            "patterns": [
                "What is my current location?",
                "Where am I?",
                "Can you tell me my location?",
                "Track my GPS location",
                "Locate me",
                "Find my current location"
            ],
            "responses": [
                "Fetching your current location...",
                "Hold on, I am getting your current location...",
                "Just a moment, determining your location...",
                "Let me check where you are..."
            ],
            "context": [""]
        },
        {
            "tag": "calculate_distance",
            "patterns": [
                "How far is it to [destination]?",
                "What is the distance to [destination]?",
                "Calculate the distance to [destination]",
                "How many kilometers to [destination]?",
                "How many miles to [destination]?",
                "Distance to [destination]"
            ],
            "responses": [
                "The distance from your current location to {destination} is approximately {distance:.2f} kilometers.",
                "The approximate distance from your current location to {destination} is {distance:.2f} kilometers.",
                "It's about {distance:.2f} kilometers from your current location to {destination}.",
                "The distance to {destination} is approximately {distance:.2f} kilometers."
            ],
            "context": [""]
        }
        
    ]
}
